adpyke.codesnap
batisteo.vscode-django
christian-kohler.path-intellisense
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
esbenp.prettier-vscode
github.copilot
github.copilot-chat
kevinrose.vsc-python-indent
mechatroner.rainbow-csv
mhutchie.git-graph
mohsen1.prettify-json
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
njpwerner.autodocstring
oderwat.indent-rainbow
pkief.material-icon-theme
reditorsupport.r
ritwickdey.liveserver
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wholroyd.jinja
yoavbls.pretty-ts-errors
