---------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  F:\Forskningsprosjekter\PDB 2357 - Fylkeshelseundersøke_\Forskningsfiler\THNI\V&T\V&T.log
  log type:  text
 opened on:  31 Jan 2022, 16:52:29

. **anonymisering av Vestfold og Telemark - vurderinger
. *dato: 24/1 2022
. *Thomas Nilsen
. 
. /*
> Alle variabler som er vurderinger anses ikke å være identifiserende
> Tilsvarende opplysninger som ikke kan sies å være kjent utover personen selv, eller er unikt for en per
> son.
> 
> 
> Høyde og vekt erstattes med gruppert BMI
> utdanning grupperes i høy, middels og lav
> arbeid deles i tre, i arbeid utenfor arbeid og pensjonist/student/etc
> alder grupperes
> antall i husstand trunkeres ved 5
> antall barn trunkeres ved 3+
> Aldersgrupper barn fjernes - dvs der kombinasjon av omsorgspersoner/foreldre alder og barn kan være ide
> ntifiserende
> Variabler om fødeland fjernes (en selv, mor og far)
> botid i norge fjernes
> Utannelse grupperes
> 
> rekkefølge randomiseres.
> */
. cd "F:\Forskningsprosjekter\PDB 2357 - Fylkeshelseundersøke_\Forskningsfiler\THNI\V&T"
F:\Forskningsprosjekter\PDB 2357 - Fylkeshelseundersøke_\Forskningsfiler\THNI\V&T

. 
. 
. 
. use "F:\Forskningsprosjekter\PDB 2357 - Fylkeshelseundersøke_\Forskningsfiler\MAKA\Vestfold og Telemark
> \FHUS_VT_datafil.dta", clear

. 
. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  FodselsAar |     34,147    1969.305    16.37289       1925       2003
  Kjonn_Kode |          0
Sivilstand~e |          0
   kommunenr |          0
       alder |          0
-------------+---------------------------------------------------------
    svardato |     34,147    22554.36    4.713506      22550      22571
VERSJON_FH~1 |          0
      ENDRET |     34,147    22554.36    4.715286      22550      22571
    QFVT_1_1 |     34,052    1.269382    .5171846          1          4
    QFVT_1_2 |     34,058    2.107816    1.061932          1          6
-------------+---------------------------------------------------------
    QFVT_1_3 |     34,052    2.035886    1.104402          1          6
    QFVT_1_4 |     34,060    1.862096    .8890945          1          6
    QFVT_1_5 |     34,074    2.984768     1.47276          1          6
    QFVT_1_6 |     34,067    1.500983    .7554712          1          6
    QFVT_1_7 |     34,053    2.217719    1.687513          1          7
-------------+---------------------------------------------------------
    QFVT_1_8 |     34,058    2.629485    1.269756          1          6
    QFVT_1_9 |     34,040     3.62923    1.197811          1          5
   QFVT_1_10 |     34,059    2.781233    .9795754          1          5
    QFVT_2_1 |     34,069    2.194458    .8624884          1          5
    QFVT_2_2 |     34,072    2.165326    .9094438          1          5
-------------+---------------------------------------------------------
    QFVT_2_3 |     34,061    1.164176    .4797707          1          3
 QFVT_2_3A_1 |      1,045           1           0          1          1
 QFVT_2_3A_2 |        515           1           0          1          1
 QFVT_2_3A_3 |         21           1           0          1          1
 QFVT_2_3A_4 |        443           1           0          1          1
-------------+---------------------------------------------------------
    QFVT_2_4 |     33,758    173.3069    10.91285         50        250
    QFVT_2_5 |     33,322    80.38908    17.86527         25        500
    QFVT_2_6 |     34,038    1.572419    .7708475          1          4
    QFVT_2_7 |     34,023    1.365635    .6623898          1          4
    QFVT_2_8 |     33,995    1.465863    .7428175          1          4
-------------+---------------------------------------------------------
    QFVT_2_9 |     33,996    1.475762    .7142165          1          4
   QFVT_2_10 |     34,027    1.678696    .7495798          1          4
   QFVT_2_11 |     34,044     1.94604    1.021605          1          4
   QFVT_2_12 |     34,025    2.502425    1.141809          1          4
   QFVT_2_13 |     34,029    2.444885    1.015801          1          4
-------------+---------------------------------------------------------
   QFVT_2_14 |     33,684    5.181243    1.300185          1          6
   QFVT_2_15 |     33,294    12.68207    4.262297          1         39
   QFVT_2_16 |     33,980    1.514244    .4998044          1          2
  QFVT_2_16A |     16,467    2.030485    .7966702          1          4
   QFVT_2_17 |     34,011    1.739173    .4390924          1          2
-------------+---------------------------------------------------------
  QFVT_2_17A |      8,851    2.022596     .725444          1          4
   QFVT_2_18 |     34,013    1.563696    .4959335          1          2
  QFVT_2_18A |     14,518    13.31265     9.99193          1         28
  QFVT_2_18B |     14,425    6.452478    8.720444          1         29
   QFVT_2_19 |     34,012    1.583294    .4930205          1          2
-------------+---------------------------------------------------------
  QFVT_2_19A |     13,904    13.70843    9.818727          1         28
  QFVT_2_19B |     13,743    5.359528    7.883865          1         29
    QFVT_3_1 |     34,047    3.094605    .8212482          1          4
    QFVT_3_2 |     34,020    2.029541    .8843816          1          5
    QFVT_3_3 |     33,954    2.424133     1.03639          1          5
-------------+---------------------------------------------------------
    QFVT_3_4 |     34,052    2.200869    1.051409          1          5
    QFVT_3_5 |     34,029    2.187928    .9819279          1          5
    QFVT_3_6 |     34,030    1.901646    1.002213          1          5
    QFVT_4_1 |     32,205    6.707188    3.268702          0         24
    QFVT_4_2 |     33,497    3.973251    1.374388          1          6
-------------+---------------------------------------------------------
   QFVT_4_2A |     31,664     1.66154    .5658965          1          3
   QFVT_4_2B |     31,700    3.043249    .7673605          1          4
 QFVT_4_2C_1 |     30,487    1.711648    .4530033          1          2
 QFVT_4_2C_2 |     30,113    1.670408    .4700728          1          2
 QFVT_4_2C_3 |     31,123    1.120586    .3256508          1          2
-------------+---------------------------------------------------------
 QFVT_4_2C_4 |     30,045    1.321551    .4670795          1          2
 QFVT_4_2D_1 |     30,306    1.315977    .4649115          1          2
 QFVT_4_2D_2 |     30,403    1.267309    .4425623          1          2
 QFVT_4_2D_3 |     28,924    1.664293    .4722453          1          2
 QFVT_4_2D_4 |     29,838    1.502748    .5000008          1          2
-------------+---------------------------------------------------------
    QFVT_4_3 |     25,133    1.777345    .8743252          1          4
    QFVT_4_4 |     34,026    2.528272    1.727091          1          7
    QFVT_4_5 |     34,001    4.523779    1.665772          1          7
    QFVT_4_6 |     34,014    5.260804    1.212706          1          7
    QFVT_4_7 |     34,020    3.360347    1.125029          1          7
-------------+---------------------------------------------------------
    QFVT_4_8 |     34,004    1.838666    .3678441          1          2
   QFVT_4_8A |      5,462    1.419627     .493543          1          2
   QFVT_4_8B |     28,420    2.193315    .9195043          1          3
    QFVT_4_9 |     34,019    1.847262    .3597402          1          2
   QFVT_4_9A |      5,188    1.186584    .3896151          1          2
-------------+---------------------------------------------------------
   QFVT_4_9B |     28,582    2.871003    .4583865          1          3
   QFVT_4_10 |     34,043    1.033164    .1790671          1          2
  QFVT_4_10A |     32,847    2.837763     .994787          1          5
  QFVT_4_10B |     30,234     1.74274    .9870164          1          5
  QFVT_4_10C |     30,269    1.887509    .8089619          1          5
-------------+---------------------------------------------------------
    QFVT_5_1 |     33,967    2.706068    .6828839          1          3
   QFVT_5_1A |      5,560    2.068705    1.460504          1          5
   QFVT_5_1B |      5,456    7.441716    3.725982          1         12
   QFVT_5_1C |      5,452    4.655539    2.183438          1          7
    QFVT_5_2 |     34,045    1.445029    .8619009          1          5
-------------+---------------------------------------------------------
    QFVT_5_3 |     34,040     1.41792    .7796109          1          5
    QFVT_6_1 |     34,013    8.418663    2.102332          1         11
    QFVT_6_2 |     33,697    8.807935    1.976048          1         11
    QFVT_6_3 |     33,936    8.482526    2.235413          1         11
    QFVT_6_4 |     33,999    8.009353    2.129182          1         11
-------------+---------------------------------------------------------
    QFVT_6_5 |     33,939    4.716491    2.753886          1         11
    QFVT_6_6 |     33,943    3.859205    2.735433          1         11
    QFVT_6_7 |     33,960    4.326826    2.493666          1         11
    QFVT_6_8 |     33,952     2.97682    2.633845          1         11
    QFVT_6_9 |     33,867    7.302566    2.350349          1         11
-------------+---------------------------------------------------------
   QFVT_6_10 |     33,922    7.626526    2.345836          1         11
   QFVT_6_11 |     33,915    3.499425    2.660193          1         11
   QFVT_6_12 |     33,826    8.409714    2.413835          1         11
   QFVT_6_13 |     33,802    8.213804    2.187438          1         11
   QFVT_6_14 |     33,943    2.619332    1.007374          1          6
-------------+---------------------------------------------------------
   QFVT_6_15 |     33,937    8.154227    2.393776          1         11
   QFVT_6_16 |     33,928    8.393097    2.559748          1         11
   QFVT_6_17 |     33,984    9.981109    1.590938          1         11
    QFVT_7_1 |     33,967    3.744222    1.686944          1          7
    QFVT_7_2 |     32,575     4.53802    1.316037          1          7
-------------+---------------------------------------------------------
  QFVT_7_3_1 |     16,643           1           0          1          1
  QFVT_7_3_2 |      3,912           1           0          1          1
  QFVT_7_3_3 |      1,929           1           0          1          1
  QFVT_7_3_4 |        924           1           0          1          1
  QFVT_7_3_5 |        639           1           0          1          1
-------------+---------------------------------------------------------
  QFVT_7_3_6 |      3,481           1           0          1          1
  QFVT_7_3_7 |        149           1           0          1          1
  QFVT_7_3_8 |      7,711           1           0          1          1
  QFVT_7_3_9 |      2,011           1           0          1          1
 QFVT_7_3_10 |         65           1           0          1          1
-------------+---------------------------------------------------------
 QFVT_7_3_11 |        297           1           0          1          1
    QFVT_7_4 |     34,000    1.994676      1.2073          1          4
    QFVT_7_5 |     33,794    2.473782     1.15616          1          5
    QFVT_7_6 |     33,007    1.535917    .9178716          1          6
 QFVT_7_6A_1 |        715           1           0          1          1
-------------+---------------------------------------------------------
 QFVT_7_6A_2 |      2,926           1           0          1          1
 QFVT_7_6A_3 |      3,123           1           0          1          1
 QFVT_7_6A_4 |      3,060           1           0          1          1
 QFVT_7_6A_5 |      3,148           1           0          1          1
 QFVT_7_6A_6 |      2,728           1           0          1          1
-------------+---------------------------------------------------------
    QFVT_7_7 |     33,878    1.237499    .5365052          1          3
    QFVT_7_8 |     34,045    1.876693    .3287945          1          2
 QFVT_7_8A_1 |      4,142    89.08547    69.93759          1        202
 QFVT_7_8A_2 |          0
 QFVT_7_8B_1 |      4,123    95.71016    68.28761          1        202
-------------+---------------------------------------------------------
 QFVT_7_8B_2 |          0
 QFVT_7_8C_1 |      4,088     95.0252    68.43741          1        202
 QFVT_7_8C_2 |          0
   QFVT_7_8D |      4,187    5.165035    1.585059          1          7
  QFVT_8_1_1 |     33,001    1.885791    .3180693          1          2
-------------+---------------------------------------------------------
  QFVT_8_1_2 |     32,834    1.966559    .1797877          1          2
  QFVT_8_1_3 |     32,774    1.982242    .1320726          1          2
  QFVT_8_1_4 |     32,693    1.980271    .1390696          1          2
  QFVT_8_1_5 |     33,127    1.812117    .3906246          1          2
  QFVT_8_1_6 |     32,662    1.988917    .1046934          1          2
-------------+---------------------------------------------------------
  QFVT_8_1_7 |     33,098    1.795093    .4036395          1          2
  QFVT_8_1_8 |     32,966    1.800522    .3996142          1          2
  QFVT_8_1_9 |     32,912    1.780202    .4141162          1          2
 QFVT_8_1_10 |     32,651    1.946188    .2256488          1          2
 QFVT_8_1_11 |     33,011     1.69183    .4617442          1          2
-------------+---------------------------------------------------------
 QFVT_8_1_12 |     32,683     1.99743    .0506322          1          2
 QFVT_8_1_13 |     32,823    1.916065    .2772946          1          2
 QFVT_8_1_14 |     32,685    1.992382    .0869504          1          2
 QFVT_8_1_15 |     32,778    1.968973    .1733931          1          2
 QFVT_8_1_16 |     32,782    1.867183    .3393818          1          2
-------------+---------------------------------------------------------
    QFVT_8_2 |     33,982    1.817256     .386462          1          2
    QFVT_8_3 |     33,913    3.893993    1.080832          1          5
    QFVT_8_4 |     33,834    3.524591    1.262306          1          5
    QFVT_8_5 |     33,765    3.791204    1.085111          1          5
    QFVT_8_6 |     33,812    3.794866    1.131777          1          5
-------------+---------------------------------------------------------
    QFVT_8_7 |     33,800    3.941479    1.144521          1          5

. 
. *legger på vekter
. destring kommunenr, gen(komnum)
kommunenr: all characters numeric; komnum generated as int

. gen VEKT=.
(34,147 missing values generated)

. replace VEKT=1.10 if komnum==3801
(2,234 real changes made)

. replace VEKT=1.10 if komnum==3802
(1,835 real changes made)

. replace VEKT=1.09 if komnum==3803
(4,491 real changes made)

. replace VEKT=1.11 if komnum==3804
(4,779 real changes made)

. replace VEKT=1.13 if komnum==3805
(3,617 real changes made)

. replace VEKT=1.13 if komnum==3806
(2,386 real changes made)

. replace VEKT=1.13 if komnum==3807
(3,571 real changes made)

. replace VEKT=1.12 if komnum==3808
(855 real changes made)

. replace VEKT=1.10 if komnum==3811
(2,244 real changes made)

. replace VEKT=0.33 if komnum==3812
(514 real changes made)

. replace VEKT=1.13 if komnum==3813
(875 real changes made)

. replace VEKT=1.15 if komnum==3814
(647 real changes made)

. replace VEKT=0.35 if komnum==3815
(839 real changes made)

. replace VEKT=1.18 if komnum==3816
(402 real changes made)

. replace VEKT=1.14 if komnum==3817
(734 real changes made)

. replace VEKT=1.11 if komnum==3818
(468 real changes made)

. replace VEKT=0.36 if komnum==3819
(285 real changes made)

. replace VEKT=0.35 if komnum==3820
(643 real changes made)

. replace VEKT=0.35 if komnum==3821
(554 real changes made)

. replace VEKT=0.34 if komnum==3822
(300 real changes made)

. replace VEKT=0.35 if komnum==3823
(355 real changes made)

. replace VEKT=0.35 if komnum==3824
(524 real changes made)

. replace VEKT=0.34 if komnum==3825
(995 real changes made)

. tab VEKT

       VEKT |      Freq.     Percent        Cum.
------------+-----------------------------------
        .33 |        514        1.51        1.51
        .34 |      1,295        3.79        5.30
        .35 |      2,915        8.54       13.83
        .36 |        285        0.83       14.67
       1.09 |      4,491       13.15       27.82
        1.1 |      6,313       18.49       46.31
       1.11 |      5,247       15.37       61.67
       1.12 |        855        2.50       64.18
       1.13 |     10,449       30.60       94.78
       1.14 |        734        2.15       96.93
       1.15 |        647        1.89       98.82
       1.18 |        402        1.18      100.00
------------+-----------------------------------
      Total |     34,147      100.00

. 
. ***************************
. * Alder                                   *
. ***************************
. *Alder
. label var alder Alder

. destring alder, replace
alder: all characters numeric; replaced as byte

. 
. 
. *Alderskategorier
. egen alderkat=cut(alder), at(18,30,40,50,60,70,100) icodes

. label define alderkat 0 "18-29" 1 "30-39" 2 "40-49" 3 "50-59" 4 "60-69" 5 "70+", modify

. label var alderkat Alderskategorier

. label val alderkat alderkat

. 
. table alderkat, statistic(min alder) statistic(max alder) statistic(  count alder)

--------------------------------------------------------------------------------
                 |  Minimum value   Maximum value   Number of non-missing values
-----------------+--------------------------------------------------------------
Alderskategorier |                                                              
  18-29          |             18              29                          3,967
  30-39          |             30              39                          4,670
  40-49          |             40              49                          5,922
  50-59          |             50              59                          7,448
  60-69          |             60              69                          6,986
  70+            |             70              96                          5,154
  Total          |             18              96                         34,147
--------------------------------------------------------------------------------

. 
. *dropper alder og fødselsår
. drop alder

. drop FodselsAar

. 
. *Fjerner landbakgrunn
. drop QFVT_7_8-QFVT_7_8D  //landbakgrunn og botid i Norge

. 
. 
. 
. *antall barn trunkeres på 3. 
. gen antallbarn18=QFVT_7_6-1
(1,140 missing values generated)

. replace antallbarn18=3 if QFVT_7_6>3 & QFVT_7_6<.
(235 real changes made)

. tab antallbarn18 QFVT_7_6, missing

           |  QFVT_7_6:VT_TSD_NN; (QFVT_7_6:VT_TSD_BM); 7.6. Hvor mange barn under 18 år
antallbarn |                                    har d
        18 |         0          1          2          3          4  5 ELLER F          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |    23,000          0          0          0          0          0          0 |    23,000 
         1 |         0      4,111          0          0          0          0          0 |     4,111 
         2 |         0          0      4,393          0          0          0          0 |     4,393 
         3 |         0          0          0      1,268        187         48          0 |     1,503 
         . |         0          0          0          0          0          0      1,140 |     1,140 
-----------+-----------------------------------------------------------------------------+----------
     Total |    23,000      4,111      4,393      1,268        187         48      1,140 |    34,147 

. label variable antallbarn18 "antall barn under 18 år"

. label define antallbarn 0 "0" 1 "1" 2 "2" 3 "3+"

. label values antallbarn18 antallbarn

. tab antallbarn18 QFVT_7_6

    antall |  QFVT_7_6:VT_TSD_NN; (QFVT_7_6:VT_TSD_BM); 7.6. Hvor mange barn
barn under |                         under 18 år har d
     18 år |         0          1          2          3          4  5 ELLER F |     Total
-----------+------------------------------------------------------------------+----------
         0 |    23,000          0          0          0          0          0 |    23,000 
         1 |         0      4,111          0          0          0          0 |     4,111 
         2 |         0          0      4,393          0          0          0 |     4,393 
        3+ |         0          0          0      1,268        187         48 |     1,503 
-----------+------------------------------------------------------------------+----------
     Total |    23,000      4,111      4,393      1,268        187         48 |    33,007 

. drop QFVT_7_6

. 
. 
. *fjerner verdier for de øverste tre aldersgrupper for barn under barnehagealder
. tab alderkat QFVT_7_6A_1, missing

           | QFVT_7_6A_1:VT_TSD_NN
           |           ;
           | (QFVT_7_6A_1:VT_TSD_B
           |        M); Før
           |  barnehagealder; 7.
Alderskate |       7.6A.KRYS
    gorier |         1          . |     Total
-----------+----------------------+----------
     18-29 |       175      3,792 |     3,967 
     30-39 |       451      4,219 |     4,670 
     40-49 |        77      5,845 |     5,922 
     50-59 |        11      7,437 |     7,448 
     60-69 |         1      6,985 |     6,986 
       70+ |         0      5,154 |     5,154 
-----------+----------------------+----------
     Total |       715     33,432 |    34,147 

. replace QFVT_7_6A_1=. if alderkat==3 | alderkat==4 | alderkat==5
(12 real changes made, 12 to missing)

. tab alderkat QFVT_7_6A_1, missing 

           | QFVT_7_6A_1:VT_TSD_NN
           |           ;
           | (QFVT_7_6A_1:VT_TSD_B
           |        M); Før
           |  barnehagealder; 7.
Alderskate |       7.6A.KRYS
    gorier |         1          . |     Total
-----------+----------------------+----------
     18-29 |       175      3,792 |     3,967 
     30-39 |       451      4,219 |     4,670 
     40-49 |        77      5,845 |     5,922 
     50-59 |         0      7,448 |     7,448 
     60-69 |         0      6,986 |     6,986 
       70+ |         0      5,154 |     5,154 
-----------+----------------------+----------
     Total |       703     33,444 |    34,147 

. drop QFVT_7_6A_1

. 
. *fjerner verderier for barn barnehagealder i de to øverste aldersgrupper
. tab alderkat QFVT_7_6A_2, missing

           | QFVT_7_6A_2:VT_TSD_NN
           |           ;
           | (QFVT_7_6A_2:VT_TSD_B
           |  M); Barnehagealder;
Alderskate |   7. 7.6A.KRYSS AV
    gorier |         1          . |     Total
-----------+----------------------+----------
     18-29 |       340      3,627 |     3,967 
     30-39 |     1,908      2,762 |     4,670 
     40-49 |       634      5,288 |     5,922 
     50-59 |        34      7,414 |     7,448 
     60-69 |         7      6,979 |     6,986 
       70+ |         3      5,151 |     5,154 
-----------+----------------------+----------
     Total |     2,926     31,221 |    34,147 

. replace QFVT_7_6A_2=. if alderkat==4 | alderkat==5
(10 real changes made, 10 to missing)

. tab alderkat QFVT_7_6A_2, missing 

           | QFVT_7_6A_2:VT_TSD_NN
           |           ;
           | (QFVT_7_6A_2:VT_TSD_B
           |  M); Barnehagealder;
Alderskate |   7. 7.6A.KRYSS AV
    gorier |         1          . |     Total
-----------+----------------------+----------
     18-29 |       340      3,627 |     3,967 
     30-39 |     1,908      2,762 |     4,670 
     40-49 |       634      5,288 |     5,922 
     50-59 |        34      7,414 |     7,448 
     60-69 |         0      6,986 |     6,986 
       70+ |         0      5,154 |     5,154 
-----------+----------------------+----------
     Total |     2,916     31,231 |    34,147 

. drop QFVT_7_6A_2

. 
. 
. *fjerner verderier for barn  småskolen i aldersgrupper 60-69 og 70+ barneskolealder, trinn 1-4
. tab alderkat QFVT_7_6A_3, missing

           | QFVT_7_6A_3:VT_TSD_NN
           |           ;
           | (QFVT_7_6A_3:VT_TSD_B
           |  M); Barneskolealder
Alderskate |   (1.-4.trinn); 7.
    gorier |         1          . |     Total
-----------+----------------------+----------
     18-29 |       118      3,849 |     3,967 
     30-39 |     1,588      3,082 |     4,670 
     40-49 |     1,277      4,645 |     5,922 
     50-59 |       123      7,325 |     7,448 
     60-69 |        15      6,971 |     6,986 
       70+ |         2      5,152 |     5,154 
-----------+----------------------+----------
     Total |     3,123     31,024 |    34,147 

. replace QFVT_7_6A_3=. if alderkat==4 & alderkat==5
(0 real changes made)

. tab alderkat QFVT_7_6A_3, missing 

           | QFVT_7_6A_3:VT_TSD_NN
           |           ;
           | (QFVT_7_6A_3:VT_TSD_B
           |  M); Barneskolealder
Alderskate |   (1.-4.trinn); 7.
    gorier |         1          . |     Total
-----------+----------------------+----------
     18-29 |       118      3,849 |     3,967 
     30-39 |     1,588      3,082 |     4,670 
     40-49 |     1,277      4,645 |     5,922 
     50-59 |       123      7,325 |     7,448 
     60-69 |        15      6,971 |     6,986 
       70+ |         2      5,152 |     5,154 
-----------+----------------------+----------
     Total |     3,123     31,024 |    34,147 

. drop QFVT_7_6A_3

. 
. *fjerner verderier for barn  i mellomtrinn i aldersgrupper i aldersgrupper 60-69 og 70+
. tab alderkat QFVT_7_6A_4, missing

           | QFVT_7_6A_4:VT_TSD_NN
           |           ;
           | (QFVT_7_6A_4:VT_TSD_B
           |  M); Barneskolealder
Alderskate |   (5.-7.trinn); 7.
    gorier |         1          . |     Total
-----------+----------------------+----------
     18-29 |        15      3,952 |     3,967 
     30-39 |       909      3,761 |     4,670 
     40-49 |     1,764      4,158 |     5,922 
     50-59 |       346      7,102 |     7,448 
     60-69 |        22      6,964 |     6,986 
       70+ |         4      5,150 |     5,154 
-----------+----------------------+----------
     Total |     3,060     31,087 |    34,147 

. replace QFVT_7_6A_4=. if alderkat==4 & alderkat==5
(0 real changes made)

. tab alderkat QFVT_7_6A_4, missing 

           | QFVT_7_6A_4:VT_TSD_NN
           |           ;
           | (QFVT_7_6A_4:VT_TSD_B
           |  M); Barneskolealder
Alderskate |   (5.-7.trinn); 7.
    gorier |         1          . |     Total
-----------+----------------------+----------
     18-29 |        15      3,952 |     3,967 
     30-39 |       909      3,761 |     4,670 
     40-49 |     1,764      4,158 |     5,922 
     50-59 |       346      7,102 |     7,448 
     60-69 |        22      6,964 |     6,986 
       70+ |         4      5,150 |     5,154 
-----------+----------------------+----------
     Total |     3,060     31,087 |    34,147 

. drop QFVT_7_6A_4

. 
. *fjerner verderier for barn i aldersgrupper 70+ ungdomssskole
. tab alderkat QFVT_7_6A_5, missing

           | QFVT_7_6A_5:VT_TSD_NN
           |           ;
           | (QFVT_7_6A_5:VT_TSD_B
           | M); Ungdomsskolealder
Alderskate |    (8.-10.trinn);
    gorier |         1          . |     Total
-----------+----------------------+----------
     18-29 |         7      3,960 |     3,967 
     30-39 |       452      4,218 |     4,670 
     40-49 |     1,911      4,011 |     5,922 
     50-59 |       712      6,736 |     7,448 
     60-69 |        58      6,928 |     6,986 
       70+ |         8      5,146 |     5,154 
-----------+----------------------+----------
     Total |     3,148     30,999 |    34,147 

. replace QFVT_7_6A_5=. if alderkat==5
(8 real changes made, 8 to missing)

. tab alderkat QFVT_7_6A_5, missing 

           | QFVT_7_6A_5:VT_TSD_NN
           |           ;
           | (QFVT_7_6A_5:VT_TSD_B
           | M); Ungdomsskolealder
Alderskate |    (8.-10.trinn);
    gorier |         1          . |     Total
-----------+----------------------+----------
     18-29 |         7      3,960 |     3,967 
     30-39 |       452      4,218 |     4,670 
     40-49 |     1,911      4,011 |     5,922 
     50-59 |       712      6,736 |     7,448 
     60-69 |        58      6,928 |     6,986 
       70+ |         0      5,154 |     5,154 
-----------+----------------------+----------
     Total |     3,140     31,007 |    34,147 

. drop QFVT_7_6A_5

. 
. *fjerner verderier for barn i aldersgrupper 70+ videregående
. tab alderkat QFVT_7_6A_6, missing

           | QFVT_7_6A_6:VT_TSD_NN
           |           ;
           | (QFVT_7_6A_6:VT_TSD_B
           |   M); Videregående
Alderskate |  skolealder; 7. 7.6A
    gorier |         1          . |     Total
-----------+----------------------+----------
     18-29 |         6      3,961 |     3,967 
     30-39 |       145      4,525 |     4,670 
     40-49 |     1,536      4,386 |     5,922 
     50-59 |       951      6,497 |     7,448 
     60-69 |        75      6,911 |     6,986 
       70+ |        15      5,139 |     5,154 
-----------+----------------------+----------
     Total |     2,728     31,419 |    34,147 

. replace QFVT_7_6A_6=. if alderkat==5
(15 real changes made, 15 to missing)

. tab alderkat QFVT_7_6A_6, missing 

           | QFVT_7_6A_6:VT_TSD_NN
           |           ;
           | (QFVT_7_6A_6:VT_TSD_B
           |   M); Videregående
Alderskate |  skolealder; 7. 7.6A
    gorier |         1          . |     Total
-----------+----------------------+----------
     18-29 |         6      3,961 |     3,967 
     30-39 |       145      4,525 |     4,670 
     40-49 |     1,536      4,386 |     5,922 
     50-59 |       951      6,497 |     7,448 
     60-69 |        75      6,911 |     6,986 
       70+ |         0      5,154 |     5,154 
-----------+----------------------+----------
     Total |     2,713     31,434 |    34,147 

. drop QFVT_7_6A_6

. 
. *setter opp KMI, fjerner høyde og vekt, og trunkerer
. gen KMI=.
(34,147 missing values generated)

. replace KMI=QFVT_2_5/((QFVT_2_4/100)^2)
(33,280 real changes made)

. 
. *tar bort KMI som ansees som urealistiske
. recode KMI (min/13.999=.) (80.001/max=.)
(107 changes made to KMI)

. 
. *grupperer KMI
. recode KMI (min/18.49999=1 "<18.5")(18.5/24.999=2 "18.5-24,9")(25/29.999=3 "25-29,9")(30/34.999=4 "30-3
> 4,9")(35/39.999=5 "35-39,9")(40/max=6 "40+"), gen(KMIgruppert)
(33173 differences between KMI and KMIgruppert)

. 
. drop QFVT_2_5 QFVT_2_4 KMI

. 
. *Aktivitet, slås sammen i tre kategorier, var  QFVT_7_3_1- QFVT_7_3_11
. gen aktivitet=.
(34,147 missing values generated)

. replace aktivitet=1 if QFVT_7_3_1==1 | QFVT_7_3_3==1            //fulltid eller selvstendig næringsdriv
> ende
(18,024 real changes made)

. replace  aktivitet=2 if (QFVT_7_3_4==1 | QFVT_7_3_5==1 | QFVT_7_3_6==1 | QFVT_7_3_7==1) & aktivitet!=1
(4,553 real changes made)

. replace aktivitet=3 if (QFVT_7_3_2==1 | QFVT_7_3_8==1 | QFVT_7_3_9==1 |  QFVT_7_3_10==1 | QFVT_7_3_11==
> 1) & aktivitet!=1
(12,166 real changes made)

. label define a 1 "Fulltidsarbeid" 2 "syk/ledig/stønad/trygd" 3 "Pensjon/student/etc."

. label value aktivitet a

. tab aktivitet

             aktivitet |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
        Fulltidsarbeid |     18,024       53.14       53.14
syk/ledig/stønad/trygd |      3,728       10.99       64.13
  Pensjon/student/etc. |     12,166       35.87      100.00
-----------------------+-----------------------------------
                 Total |     33,918      100.00

. 
. drop QFVT_7_3_1- QFVT_7_3_11

. 
. *utdannelse - kodet 1-7 tredelt
. tab QFVT_7_1, nolabel 

QFVT_7_1:VT |
   _TSD_NN; |
(QFVT_7_1:V |
 T_TSD_BM); |
7.1. Hva er |
        din |
    høyeste |
  fullførte |
       utda |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,454        7.22        7.22
          2 |      9,483       27.92       35.14
          3 |      3,964       11.67       46.81
          4 |      2,836        8.35       55.16
          5 |      9,130       26.88       82.04
          6 |      5,826       17.15       99.19
          7 |        274        0.81      100.00
------------+-----------------------------------
      Total |     33,967      100.00

. gen utdannelse=.
(34,147 missing values generated)

. replace utdannelse=1 if QFVT_7_1==1
(2,454 real changes made)

. replace utdannelse=2 if QFVT_7_1>1 & QFVT_7_1<5
(16,283 real changes made)

. replace utdannelse=3 if QFVT_7_1>4 & QFVT_7_1<.
(15,230 real changes made)

. label define u 1 "Grunnskole/tilsv." 2 "Vgs/fag/høy/uni<2" 3 "Høy(Uni>2)"

. label values utdannelse u

. tab  QFVT_7_1 utdannelse 

  QFVT_7_1:VT_TSD_NN; |
(QFVT_7_1:VT_TSD_BM); |
      7.1. Hva er din |
    høyeste fullførte |            utdannelse
                 utda | Grunnskol  Vgs/fag/h  Høy(Uni>2 |     Total
----------------------+---------------------------------+----------
GRUNNSKOLE ELLER TILS |     2,454          0          0 |     2,454 
VIDEREGÅENDE SKOLE EL |         0      9,483          0 |     9,483 
             FAGSKOLE |         0      3,964          0 |     3,964 
HØGSKOLE/UNIVERSITET, |         0      2,836          0 |     2,836 
HØGSKOLE/UNIVERSITET, |         0          0      9,130 |     9,130 
HØGSKOLE/UNIVERSITET, |         0          0      5,826 |     5,826 
INGEN FULLFØRT UTDANN |         0          0        274 |       274 
----------------------+---------------------------------+----------
                Total |     2,454     16,283     15,230 |    33,967 

. 
. drop QFVT_7_1

. 
. 
. *randomiserer alle individer slik at fil ikke kan matches mot original
. set seed 12345                          

. gen sortorder = runiform()      //genererer random id for alle, mellom 0 og 1.

. sort sortorder                          // sorterer fil etter id

. drop sortorder                          //dropper id.

. 
. tab aktivitet utdannelse

                      |            utdannelse
            aktivitet | Grunnskol  Vgs/fag/h  Høy(Uni>2 |     Total
----------------------+---------------------------------+----------
       Fulltidsarbeid |       611      7,865      9,521 |    17,997 
syk/ledig/stønad/tryg |       531      2,102      1,083 |     3,716 
 Pensjon/student/etc. |     1,295      6,231      4,570 |    12,096 
----------------------+---------------------------------+----------
                Total |     2,437     16,198     15,174 |    33,809 

. 
. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  Kjonn_Kode |          0
Sivilstand~e |          0
   kommunenr |          0
      komnum |     34,147    3808.084    6.488225       3801       3825
    svardato |     34,147    22554.36    4.713506      22550      22571
-------------+---------------------------------------------------------
VERSJON_FH~1 |          0
      ENDRET |     34,147    22554.36    4.715286      22550      22571
    QFVT_1_1 |     34,052    1.269382    .5171846          1          4
    QFVT_1_2 |     34,058    2.107816    1.061932          1          6
    QFVT_1_3 |     34,052    2.035886    1.104402          1          6
-------------+---------------------------------------------------------
    QFVT_1_4 |     34,060    1.862096    .8890945          1          6
    QFVT_1_5 |     34,074    2.984768     1.47276          1          6
    QFVT_1_6 |     34,067    1.500983    .7554712          1          6
    QFVT_1_7 |     34,053    2.217719    1.687513          1          7
    QFVT_1_8 |     34,058    2.629485    1.269756          1          6
-------------+---------------------------------------------------------
    QFVT_1_9 |     34,040     3.62923    1.197811          1          5
   QFVT_1_10 |     34,059    2.781233    .9795754          1          5
    QFVT_2_1 |     34,069    2.194458    .8624884          1          5
    QFVT_2_2 |     34,072    2.165326    .9094438          1          5
    QFVT_2_3 |     34,061    1.164176    .4797707          1          3
-------------+---------------------------------------------------------
 QFVT_2_3A_1 |      1,045           1           0          1          1
 QFVT_2_3A_2 |        515           1           0          1          1
 QFVT_2_3A_3 |         21           1           0          1          1
 QFVT_2_3A_4 |        443           1           0          1          1
    QFVT_2_6 |     34,038    1.572419    .7708475          1          4
-------------+---------------------------------------------------------
    QFVT_2_7 |     34,023    1.365635    .6623898          1          4
    QFVT_2_8 |     33,995    1.465863    .7428175          1          4
    QFVT_2_9 |     33,996    1.475762    .7142165          1          4
   QFVT_2_10 |     34,027    1.678696    .7495798          1          4
   QFVT_2_11 |     34,044     1.94604    1.021605          1          4
-------------+---------------------------------------------------------
   QFVT_2_12 |     34,025    2.502425    1.141809          1          4
   QFVT_2_13 |     34,029    2.444885    1.015801          1          4
   QFVT_2_14 |     33,684    5.181243    1.300185          1          6
   QFVT_2_15 |     33,294    12.68207    4.262297          1         39
   QFVT_2_16 |     33,980    1.514244    .4998044          1          2
-------------+---------------------------------------------------------
  QFVT_2_16A |     16,467    2.030485    .7966702          1          4
   QFVT_2_17 |     34,011    1.739173    .4390924          1          2
  QFVT_2_17A |      8,851    2.022596     .725444          1          4
   QFVT_2_18 |     34,013    1.563696    .4959335          1          2
  QFVT_2_18A |     14,518    13.31265     9.99193          1         28
-------------+---------------------------------------------------------
  QFVT_2_18B |     14,425    6.452478    8.720444          1         29
   QFVT_2_19 |     34,012    1.583294    .4930205          1          2
  QFVT_2_19A |     13,904    13.70843    9.818727          1         28
  QFVT_2_19B |     13,743    5.359528    7.883865          1         29
    QFVT_3_1 |     34,047    3.094605    .8212482          1          4
-------------+---------------------------------------------------------
    QFVT_3_2 |     34,020    2.029541    .8843816          1          5
    QFVT_3_3 |     33,954    2.424133     1.03639          1          5
    QFVT_3_4 |     34,052    2.200869    1.051409          1          5
    QFVT_3_5 |     34,029    2.187928    .9819279          1          5
    QFVT_3_6 |     34,030    1.901646    1.002213          1          5
-------------+---------------------------------------------------------
    QFVT_4_1 |     32,205    6.707188    3.268702          0         24
    QFVT_4_2 |     33,497    3.973251    1.374388          1          6
   QFVT_4_2A |     31,664     1.66154    .5658965          1          3
   QFVT_4_2B |     31,700    3.043249    .7673605          1          4
 QFVT_4_2C_1 |     30,487    1.711648    .4530033          1          2
-------------+---------------------------------------------------------
 QFVT_4_2C_2 |     30,113    1.670408    .4700728          1          2
 QFVT_4_2C_3 |     31,123    1.120586    .3256508          1          2
 QFVT_4_2C_4 |     30,045    1.321551    .4670795          1          2
 QFVT_4_2D_1 |     30,306    1.315977    .4649115          1          2
 QFVT_4_2D_2 |     30,403    1.267309    .4425623          1          2
-------------+---------------------------------------------------------
 QFVT_4_2D_3 |     28,924    1.664293    .4722453          1          2
 QFVT_4_2D_4 |     29,838    1.502748    .5000008          1          2
    QFVT_4_3 |     25,133    1.777345    .8743252          1          4
    QFVT_4_4 |     34,026    2.528272    1.727091          1          7
    QFVT_4_5 |     34,001    4.523779    1.665772          1          7
-------------+---------------------------------------------------------
    QFVT_4_6 |     34,014    5.260804    1.212706          1          7
    QFVT_4_7 |     34,020    3.360347    1.125029          1          7
    QFVT_4_8 |     34,004    1.838666    .3678441          1          2
   QFVT_4_8A |      5,462    1.419627     .493543          1          2
   QFVT_4_8B |     28,420    2.193315    .9195043          1          3
-------------+---------------------------------------------------------
    QFVT_4_9 |     34,019    1.847262    .3597402          1          2
   QFVT_4_9A |      5,188    1.186584    .3896151          1          2
   QFVT_4_9B |     28,582    2.871003    .4583865          1          3
   QFVT_4_10 |     34,043    1.033164    .1790671          1          2
  QFVT_4_10A |     32,847    2.837763     .994787          1          5
-------------+---------------------------------------------------------
  QFVT_4_10B |     30,234     1.74274    .9870164          1          5
  QFVT_4_10C |     30,269    1.887509    .8089619          1          5
    QFVT_5_1 |     33,967    2.706068    .6828839          1          3
   QFVT_5_1A |      5,560    2.068705    1.460504          1          5
   QFVT_5_1B |      5,456    7.441716    3.725982          1         12
-------------+---------------------------------------------------------
   QFVT_5_1C |      5,452    4.655539    2.183438          1          7
    QFVT_5_2 |     34,045    1.445029    .8619009          1          5
    QFVT_5_3 |     34,040     1.41792    .7796109          1          5
    QFVT_6_1 |     34,013    8.418663    2.102332          1         11
    QFVT_6_2 |     33,697    8.807935    1.976048          1         11
-------------+---------------------------------------------------------
    QFVT_6_3 |     33,936    8.482526    2.235413          1         11
    QFVT_6_4 |     33,999    8.009353    2.129182          1         11
    QFVT_6_5 |     33,939    4.716491    2.753886          1         11
    QFVT_6_6 |     33,943    3.859205    2.735433          1         11
    QFVT_6_7 |     33,960    4.326826    2.493666          1         11
-------------+---------------------------------------------------------
    QFVT_6_8 |     33,952     2.97682    2.633845          1         11
    QFVT_6_9 |     33,867    7.302566    2.350349          1         11
   QFVT_6_10 |     33,922    7.626526    2.345836          1         11
   QFVT_6_11 |     33,915    3.499425    2.660193          1         11
   QFVT_6_12 |     33,826    8.409714    2.413835          1         11
-------------+---------------------------------------------------------
   QFVT_6_13 |     33,802    8.213804    2.187438          1         11
   QFVT_6_14 |     33,943    2.619332    1.007374          1          6
   QFVT_6_15 |     33,937    8.154227    2.393776          1         11
   QFVT_6_16 |     33,928    8.393097    2.559748          1         11
   QFVT_6_17 |     33,984    9.981109    1.590938          1         11
-------------+---------------------------------------------------------
    QFVT_7_2 |     32,575     4.53802    1.316037          1          7
    QFVT_7_4 |     34,000    1.994676      1.2073          1          4
    QFVT_7_5 |     33,794    2.473782     1.15616          1          5
    QFVT_7_7 |     33,878    1.237499    .5365052          1          3
  QFVT_8_1_1 |     33,001    1.885791    .3180693          1          2
-------------+---------------------------------------------------------
  QFVT_8_1_2 |     32,834    1.966559    .1797877          1          2
  QFVT_8_1_3 |     32,774    1.982242    .1320726          1          2
  QFVT_8_1_4 |     32,693    1.980271    .1390696          1          2
  QFVT_8_1_5 |     33,127    1.812117    .3906246          1          2
  QFVT_8_1_6 |     32,662    1.988917    .1046934          1          2
-------------+---------------------------------------------------------
  QFVT_8_1_7 |     33,098    1.795093    .4036395          1          2
  QFVT_8_1_8 |     32,966    1.800522    .3996142          1          2
  QFVT_8_1_9 |     32,912    1.780202    .4141162          1          2
 QFVT_8_1_10 |     32,651    1.946188    .2256488          1          2
 QFVT_8_1_11 |     33,011     1.69183    .4617442          1          2
-------------+---------------------------------------------------------
 QFVT_8_1_12 |     32,683     1.99743    .0506322          1          2
 QFVT_8_1_13 |     32,823    1.916065    .2772946          1          2
 QFVT_8_1_14 |     32,685    1.992382    .0869504          1          2
 QFVT_8_1_15 |     32,778    1.968973    .1733931          1          2
 QFVT_8_1_16 |     32,782    1.867183    .3393818          1          2
-------------+---------------------------------------------------------
    QFVT_8_2 |     33,982    1.817256     .386462          1          2
    QFVT_8_3 |     33,913    3.893993    1.080832          1          5
    QFVT_8_4 |     33,834    3.524591    1.262306          1          5
    QFVT_8_5 |     33,765    3.791204    1.085111          1          5
    QFVT_8_6 |     33,812    3.794866    1.131777          1          5
-------------+---------------------------------------------------------
    QFVT_8_7 |     33,800    3.941479    1.144521          1          5
        VEKT |     34,147    1.002037    .2725714        .33       1.18
    alderkat |     34,147    2.710985    1.578263          0          5
antallbarn18 |     33,007    .5273427    .8880749          0          3
 KMIgruppert |     33,173    2.831218    .9260943          1          6
-------------+---------------------------------------------------------
   aktivitet |     33,918    1.827289    .9275151          1          3
  utdannelse |     33,967     2.37613    .6157601          1          3

. 
. save "F:\Forskningsprosjekter\PDB 2357 - Fylkeshelseundersøke_\Forskningsfiler\THNI\V&T\V&T.dta", repla
> ce
file F:\Forskningsprosjekter\PDB 2357 - Fylkeshelseundersøke_\Forskningsfiler\THNI\V&T\V&T.dta saved

. 
. export delimited "V&T", replace
file V&T.csv saved

. 
. 
. 
. 
. ********************************Ny fil med landbakgrunn*******************************''
. ***********kommunenr fjernes************************************************************
. 
. */
. cd "F:\Forskningsprosjekter\PDB 2357 - Fylkeshelseundersøke_\Forskningsfiler\THNI\V&T"
F:\Forskningsprosjekter\PDB 2357 - Fylkeshelseundersøke_\Forskningsfiler\THNI\V&T

. 
. 
. use "F:\Forskningsprosjekter\PDB 2357 - Fylkeshelseundersøke_\Forskningsfiler\MAKA\Vestfold og Telemark
> \FHUS_VT_datafil.dta", clear

. 
. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  FodselsAar |     34,147    1969.305    16.37289       1925       2003
  Kjonn_Kode |          0
Sivilstand~e |          0
   kommunenr |          0
       alder |          0
-------------+---------------------------------------------------------
    svardato |     34,147    22554.36    4.713506      22550      22571
VERSJON_FH~1 |          0
      ENDRET |     34,147    22554.36    4.715286      22550      22571
    QFVT_1_1 |     34,052    1.269382    .5171846          1          4
    QFVT_1_2 |     34,058    2.107816    1.061932          1          6
-------------+---------------------------------------------------------
    QFVT_1_3 |     34,052    2.035886    1.104402          1          6
    QFVT_1_4 |     34,060    1.862096    .8890945          1          6
    QFVT_1_5 |     34,074    2.984768     1.47276          1          6
    QFVT_1_6 |     34,067    1.500983    .7554712          1          6
    QFVT_1_7 |     34,053    2.217719    1.687513          1          7
-------------+---------------------------------------------------------
    QFVT_1_8 |     34,058    2.629485    1.269756          1          6
    QFVT_1_9 |     34,040     3.62923    1.197811          1          5
   QFVT_1_10 |     34,059    2.781233    .9795754          1          5
    QFVT_2_1 |     34,069    2.194458    .8624884          1          5
    QFVT_2_2 |     34,072    2.165326    .9094438          1          5
-------------+---------------------------------------------------------
    QFVT_2_3 |     34,061    1.164176    .4797707          1          3
 QFVT_2_3A_1 |      1,045           1           0          1          1
 QFVT_2_3A_2 |        515           1           0          1          1
 QFVT_2_3A_3 |         21           1           0          1          1
 QFVT_2_3A_4 |        443           1           0          1          1
-------------+---------------------------------------------------------
    QFVT_2_4 |     33,758    173.3069    10.91285         50        250
    QFVT_2_5 |     33,322    80.38908    17.86527         25        500
    QFVT_2_6 |     34,038    1.572419    .7708475          1          4
    QFVT_2_7 |     34,023    1.365635    .6623898          1          4
    QFVT_2_8 |     33,995    1.465863    .7428175          1          4
-------------+---------------------------------------------------------
    QFVT_2_9 |     33,996    1.475762    .7142165          1          4
   QFVT_2_10 |     34,027    1.678696    .7495798          1          4
   QFVT_2_11 |     34,044     1.94604    1.021605          1          4
   QFVT_2_12 |     34,025    2.502425    1.141809          1          4
   QFVT_2_13 |     34,029    2.444885    1.015801          1          4
-------------+---------------------------------------------------------
   QFVT_2_14 |     33,684    5.181243    1.300185          1          6
   QFVT_2_15 |     33,294    12.68207    4.262297          1         39
   QFVT_2_16 |     33,980    1.514244    .4998044          1          2
  QFVT_2_16A |     16,467    2.030485    .7966702          1          4
   QFVT_2_17 |     34,011    1.739173    .4390924          1          2
-------------+---------------------------------------------------------
  QFVT_2_17A |      8,851    2.022596     .725444          1          4
   QFVT_2_18 |     34,013    1.563696    .4959335          1          2
  QFVT_2_18A |     14,518    13.31265     9.99193          1         28
  QFVT_2_18B |     14,425    6.452478    8.720444          1         29
   QFVT_2_19 |     34,012    1.583294    .4930205          1          2
-------------+---------------------------------------------------------
  QFVT_2_19A |     13,904    13.70843    9.818727          1         28
  QFVT_2_19B |     13,743    5.359528    7.883865          1         29
    QFVT_3_1 |     34,047    3.094605    .8212482          1          4
    QFVT_3_2 |     34,020    2.029541    .8843816          1          5
    QFVT_3_3 |     33,954    2.424133     1.03639          1          5
-------------+---------------------------------------------------------
    QFVT_3_4 |     34,052    2.200869    1.051409          1          5
    QFVT_3_5 |     34,029    2.187928    .9819279          1          5
    QFVT_3_6 |     34,030    1.901646    1.002213          1          5
    QFVT_4_1 |     32,205    6.707188    3.268702          0         24
    QFVT_4_2 |     33,497    3.973251    1.374388          1          6
-------------+---------------------------------------------------------
   QFVT_4_2A |     31,664     1.66154    .5658965          1          3
   QFVT_4_2B |     31,700    3.043249    .7673605          1          4
 QFVT_4_2C_1 |     30,487    1.711648    .4530033          1          2
 QFVT_4_2C_2 |     30,113    1.670408    .4700728          1          2
 QFVT_4_2C_3 |     31,123    1.120586    .3256508          1          2
-------------+---------------------------------------------------------
 QFVT_4_2C_4 |     30,045    1.321551    .4670795          1          2
 QFVT_4_2D_1 |     30,306    1.315977    .4649115          1          2
 QFVT_4_2D_2 |     30,403    1.267309    .4425623          1          2
 QFVT_4_2D_3 |     28,924    1.664293    .4722453          1          2
 QFVT_4_2D_4 |     29,838    1.502748    .5000008          1          2
-------------+---------------------------------------------------------
    QFVT_4_3 |     25,133    1.777345    .8743252          1          4
    QFVT_4_4 |     34,026    2.528272    1.727091          1          7
    QFVT_4_5 |     34,001    4.523779    1.665772          1          7
    QFVT_4_6 |     34,014    5.260804    1.212706          1          7
    QFVT_4_7 |     34,020    3.360347    1.125029          1          7
-------------+---------------------------------------------------------
    QFVT_4_8 |     34,004    1.838666    .3678441          1          2
   QFVT_4_8A |      5,462    1.419627     .493543          1          2
   QFVT_4_8B |     28,420    2.193315    .9195043          1          3
    QFVT_4_9 |     34,019    1.847262    .3597402          1          2
   QFVT_4_9A |      5,188    1.186584    .3896151          1          2
-------------+---------------------------------------------------------
   QFVT_4_9B |     28,582    2.871003    .4583865          1          3
   QFVT_4_10 |     34,043    1.033164    .1790671          1          2
  QFVT_4_10A |     32,847    2.837763     .994787          1          5
  QFVT_4_10B |     30,234     1.74274    .9870164          1          5
  QFVT_4_10C |     30,269    1.887509    .8089619          1          5
-------------+---------------------------------------------------------
    QFVT_5_1 |     33,967    2.706068    .6828839          1          3
   QFVT_5_1A |      5,560    2.068705    1.460504          1          5
   QFVT_5_1B |      5,456    7.441716    3.725982          1         12
   QFVT_5_1C |      5,452    4.655539    2.183438          1          7
    QFVT_5_2 |     34,045    1.445029    .8619009          1          5
-------------+---------------------------------------------------------
    QFVT_5_3 |     34,040     1.41792    .7796109          1          5
    QFVT_6_1 |     34,013    8.418663    2.102332          1         11
    QFVT_6_2 |     33,697    8.807935    1.976048          1         11
    QFVT_6_3 |     33,936    8.482526    2.235413          1         11
    QFVT_6_4 |     33,999    8.009353    2.129182          1         11
-------------+---------------------------------------------------------
    QFVT_6_5 |     33,939    4.716491    2.753886          1         11
    QFVT_6_6 |     33,943    3.859205    2.735433          1         11
    QFVT_6_7 |     33,960    4.326826    2.493666          1         11
    QFVT_6_8 |     33,952     2.97682    2.633845          1         11
    QFVT_6_9 |     33,867    7.302566    2.350349          1         11
-------------+---------------------------------------------------------
   QFVT_6_10 |     33,922    7.626526    2.345836          1         11
   QFVT_6_11 |     33,915    3.499425    2.660193          1         11
   QFVT_6_12 |     33,826    8.409714    2.413835          1         11
   QFVT_6_13 |     33,802    8.213804    2.187438          1         11
   QFVT_6_14 |     33,943    2.619332    1.007374          1          6
-------------+---------------------------------------------------------
   QFVT_6_15 |     33,937    8.154227    2.393776          1         11
   QFVT_6_16 |     33,928    8.393097    2.559748          1         11
   QFVT_6_17 |     33,984    9.981109    1.590938          1         11
    QFVT_7_1 |     33,967    3.744222    1.686944          1          7
    QFVT_7_2 |     32,575     4.53802    1.316037          1          7
-------------+---------------------------------------------------------
  QFVT_7_3_1 |     16,643           1           0          1          1
  QFVT_7_3_2 |      3,912           1           0          1          1
  QFVT_7_3_3 |      1,929           1           0          1          1
  QFVT_7_3_4 |        924           1           0          1          1
  QFVT_7_3_5 |        639           1           0          1          1
-------------+---------------------------------------------------------
  QFVT_7_3_6 |      3,481           1           0          1          1
  QFVT_7_3_7 |        149           1           0          1          1
  QFVT_7_3_8 |      7,711           1           0          1          1
  QFVT_7_3_9 |      2,011           1           0          1          1
 QFVT_7_3_10 |         65           1           0          1          1
-------------+---------------------------------------------------------
 QFVT_7_3_11 |        297           1           0          1          1
    QFVT_7_4 |     34,000    1.994676      1.2073          1          4
    QFVT_7_5 |     33,794    2.473782     1.15616          1          5
    QFVT_7_6 |     33,007    1.535917    .9178716          1          6
 QFVT_7_6A_1 |        715           1           0          1          1
-------------+---------------------------------------------------------
 QFVT_7_6A_2 |      2,926           1           0          1          1
 QFVT_7_6A_3 |      3,123           1           0          1          1
 QFVT_7_6A_4 |      3,060           1           0          1          1
 QFVT_7_6A_5 |      3,148           1           0          1          1
 QFVT_7_6A_6 |      2,728           1           0          1          1
-------------+---------------------------------------------------------
    QFVT_7_7 |     33,878    1.237499    .5365052          1          3
    QFVT_7_8 |     34,045    1.876693    .3287945          1          2
 QFVT_7_8A_1 |      4,142    89.08547    69.93759          1        202
 QFVT_7_8A_2 |          0
 QFVT_7_8B_1 |      4,123    95.71016    68.28761          1        202
-------------+---------------------------------------------------------
 QFVT_7_8B_2 |          0
 QFVT_7_8C_1 |      4,088     95.0252    68.43741          1        202
 QFVT_7_8C_2 |          0
   QFVT_7_8D |      4,187    5.165035    1.585059          1          7
  QFVT_8_1_1 |     33,001    1.885791    .3180693          1          2
-------------+---------------------------------------------------------
  QFVT_8_1_2 |     32,834    1.966559    .1797877          1          2
  QFVT_8_1_3 |     32,774    1.982242    .1320726          1          2
  QFVT_8_1_4 |     32,693    1.980271    .1390696          1          2
  QFVT_8_1_5 |     33,127    1.812117    .3906246          1          2
  QFVT_8_1_6 |     32,662    1.988917    .1046934          1          2
-------------+---------------------------------------------------------
  QFVT_8_1_7 |     33,098    1.795093    .4036395          1          2
  QFVT_8_1_8 |     32,966    1.800522    .3996142          1          2
  QFVT_8_1_9 |     32,912    1.780202    .4141162          1          2
 QFVT_8_1_10 |     32,651    1.946188    .2256488          1          2
 QFVT_8_1_11 |     33,011     1.69183    .4617442          1          2
-------------+---------------------------------------------------------
 QFVT_8_1_12 |     32,683     1.99743    .0506322          1          2
 QFVT_8_1_13 |     32,823    1.916065    .2772946          1          2
 QFVT_8_1_14 |     32,685    1.992382    .0869504          1          2
 QFVT_8_1_15 |     32,778    1.968973    .1733931          1          2
 QFVT_8_1_16 |     32,782    1.867183    .3393818          1          2
-------------+---------------------------------------------------------
    QFVT_8_2 |     33,982    1.817256     .386462          1          2
    QFVT_8_3 |     33,913    3.893993    1.080832          1          5
    QFVT_8_4 |     33,834    3.524591    1.262306          1          5
    QFVT_8_5 |     33,765    3.791204    1.085111          1          5
    QFVT_8_6 |     33,812    3.794866    1.131777          1          5
-------------+---------------------------------------------------------
    QFVT_8_7 |     33,800    3.941479    1.144521          1          5

. 
. *Landgruppe etter eget fødeland variabler QFVT_7_8  til QFVT_7_8C_2 
. /* Inndelinger i landgrupper er fra SSB EuSilc 2018 https://www.ssb.no/sosiale-forhold-og-kriminalitet/
> artikler-og-publikasjoner/_attachment/380980?_ts=1697b0fc950
> SSB definerer landbakgrunn også etter foreldres fødeland. Det gjøres ikke her, men kan konstrueres selv
> .
> Variabelen er gruppert i følgende grupper:
> 1 = Norge
> 2 = Norden
> 3 = EU/EØS-området utenom Norden
> 4 = Europa utenfor EU/EØS-området
> 5 = Asia, Afrika, Latin-Amerika, Oseania utenom Australia og New Zealand
> 6 = USA, Canada, Australia og New Zealand
> 
> I Europeiske land utenom EU/EØS inngår: Albania, Bosnia-Hercegovina, Hviterussland, Kosovo, Kroatia, Ma
> kedonia, Moldova, Montenegro, Russland, Serbia og Ukraina. https://www.ssb.no/omssb/om-oss/nyheter-om-s
> sb/ny-innvandrergruppering
> NB: Storbritannia lagt til i 6. 
> Sveits lagt i 3. 
> */
. sum QFVT_7_8A_1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 QFVT_7_8A_1 |      4,142    89.08547    69.93759          1        202

. 
. #delimit ;
delimiter now ;
. label define land
> 1       "Norge" 
> 2       "Afghanistan" 
> 3       "Albania" 
> 4       "Algerie" 
> 5       "Andorra"
> 6       "Angola"
> 7       "Antigua og Barbuda"
> 8       "Argentina"
> 9       "Armenia"
> 10      "Aserbajdsjan"
> 11      "Australia"
> 12      "Bahamas"
> 13      "Bahrain"
> 14      "Bangladesh"
> 15      "Barbados"
> 16      "Belgia"
> 17      "Belize"
> 18      "Benin"
> 19      "Bhutan"
> 20      "Bolivia"
> 21      "Bosnia-Hercegovina"
> 22      "Botswana"
> 23      "Brasil"
> 24      "Brunei"
> 25      "Bulgaria"
> 26      "Burkina Faso"
> 27      "Burundi"
> 28      "Canada"
> 29      "Chile"
> 30      "Colombia"
> 31      "Cookøyene"
> 32      "Costa Rica"
> 33      "Cuba"
> 34      "Danmark"
> 35      "De forente arabiske emirater"
> 36      "Den dominikanske republikk"
> 37      "Den sentralafrikanske republikk"
> 38      "Djibouti"
> 39      "Dominica"
> 40      "Ecuador"
> 41      "Egypt"
> 42      "Ekvatorial-Guinea"
> 43      "El Salvador"
> 44      "Elfenbenskysten"
> 45      "Eritrea"
> 46      "Estland"
> 47      "eSwatini"
> 48      "Etiopia"
> 49      "Fiji"
> 50      "Filippinene"
> 51      "Finland"
> 52      "Frankrike"
> 53      "Gabon"
> 54      "Gambia"
> 55      "Georgia"
> 56      "Ghana"
> 57      "Grenada"
> 58      "Guatemala"
> 59      "Guinea"
> 60      "Guinea-Bissau"
> 61      "Guyana"
> 62      "Haiti"
> 63      "Hellas"
> 64      "Honduras"
> 65      "Hviterussland"
> 66      "India"
> 67      "Indonesia"
> 68      "Irak"
> 69      "Iran"
> 70      "Irland"
> 71      "Island"
> 72      "Israel"
> 73      "Italia"
> 74      "Jamaica"
> 75      "Japan"
> 76      "Jemen"
> 77      "Jordan"
> 78      "Kambodsja"
> 79      "Kamerun"
> 80      "Kapp Verde"
> 81      "Kasakhstan"
> 82      "Kenya"
> 83      "Kina"
> 84      "Kirgisistan"
> 85      "Kiribati"
> 86      "Komorene"
> 87      "Kongo, Den demokratiske republikken"
> 88      "Kongo, Republikken"
> 89      "Kosovo"
> 90      "Kroatia"
> 91      "Kuwait"
> 92      "Kypros"
> 93      "Laos"
> 94      "Latvia"
> 95      "Lesotho"
> 96      "Libanon"
> 97      "Liberia"
> 98      "Libya"
> 99      "Liechtenstein"
> 100     "Litauen"
> 101     "Luxembourg"
> 102     "Madagaskar"
> 103     "Malawi"
> 104     "Malaysia"
> 105     "Maldivene"
> 106     "Mali"
> 107     "Malta"
> 108     "Marokko"
> 109     "Marshalløyene"
> 110     "Mauritania"
> 111     "Mauritius"
> 112     "Mexico"
> 113     "Mikronesia"
> 114     "Moldova"
> 115     "Monaco"
> 116     "Mongolia"
> 117     "Montenegro"
> 118     "Mosambik"
> 119     "Myanmar (Burma)"
> 120     "Namibia"
> 121     "Nauru"
> 122     "Nederland"
> 123     "Nepal"
> 124     "New Zealand"
> 125     "Nicaragua"
> 126     "Niger"
> 127     "Nigeria"
> 128     "Niue"
> 129     "Nord-Korea"
> 130     "Nord-Makedonia"
> 131     "Norge"
> 132     "Oman"
> 133     "Pakistan"
> 134     "Palau"
> 135     "Palestina"
> 136     "Panama"
> 137     "Papua Ny-Guinea"
> 138     "Paraguay"
> 139     "Peru"
> 140     "Polen"
> 141     "Portugal"
> 142     "Qatar"
> 143     "Romania"
> 144     "Russland"
> 145     "Rwanda"
> 146     "Saint Kitts og Nevis"
> 147     "Saint Lucia"
> 148     "Saint Vincent og Grenadinene"
> 149     "Salomonøyene"
> 150     "Samoa"
> 151     "San Marino"
> 152     "São Tomé og Príncipe"
> 153     "Saudi-Arabia"
> 154     "Senegal"
> 155     "Serbia"
> 156     "Seychellene"
> 157     "Sierra Leone"
> 158     "Singapore"
> 159     "Slovakia"
> 160     "Slovenia"
> 161     "Somalia"
> 162     "Spania"
> 163     "Sri Lanka"
> 164     "Storbritannia"
> 165     "Sudan"
> 166     "Surinam"
> 167     "Sveits"
> 168     "Sverige"
> 169     "Syria"
> 170     "Sør-Afrika"
> 171     "Sør-Korea"
> 172     "Sør-Sudan"
> 173     "Tadsjikistan"
> 174     "Taiwan"
> 175     "Tanzania"
> 176     "Thailand"
> 177     "Togo"
> 178     "Tonga"
> 179     "Trinidad og Tobago"
> 180     "Tsjad"
> 181     "Tsjekkia"
> 182     "Tunisia"
> 183     "Turkmenistan"
> 184     "Tuvalu"
> 185     "Tyrkia"
> 186     "Tyskland"
> 187     "Uganda"
> 188     "Ukraina"
> 189     "Ungarn"
> 190     "Uruguay"
> 191     "USA"
> 192     "Usbekistan"
> 193     "Vanuatu"
> 194     "Vatikanstaten"
> 195     "Venezuela"
> 196     "Vest-Sahara"
> 197     "Vietnam"
> 198     "Zambia"
> 199     "Zimbabwe"
> 200     "Østerrike"
> 201     "Øst-Timor"
> 202 "Annet";

. #delimit cr
delimiter now cr
. 
. label values QFVT_7_8A_1 land

. tab QFVT_7_8A_1

             QFVT_7_8A_1:VT_TSD_NN; |
   (QFVT_7_8A_1:VT_TSD_BM); 7.8a. I |
           hvilket land er du født? |      Freq.     Percent        Cum.
------------------------------------+-----------------------------------
                              Norge |      1,023       24.70       24.70
                        Afghanistan |         18        0.43       25.13
                            Albania |          4        0.10       25.23
                            Algerie |          3        0.07       25.30
                            Andorra |          1        0.02       25.33
                             Angola |          4        0.10       25.42
                          Argentina |          4        0.10       25.52
                            Armenia |          1        0.02       25.54
                       Aserbajdsjan |          1        0.02       25.57
                          Australia |         11        0.27       25.83
                         Bangladesh |          3        0.07       25.91
                           Barbados |          1        0.02       25.93
                             Belgia |         13        0.31       26.24
                             Belize |          1        0.02       26.27
                              Benin |          1        0.02       26.29
                             Bhutan |          3        0.07       26.36
                            Bolivia |          6        0.14       26.51
                 Bosnia-Hercegovina |         47        1.13       27.64
                           Botswana |          1        0.02       27.67
                             Brasil |         25        0.60       28.27
                             Brunei |          1        0.02       28.30
                           Bulgaria |         18        0.43       28.73
                       Burkina Faso |          1        0.02       28.75
                            Burundi |          4        0.10       28.85
                             Canada |         17        0.41       29.26
                              Chile |         19        0.46       29.72
                           Colombia |         24        0.58       30.30
                               Cuba |          6        0.14       30.44
                            Danmark |        217        5.24       35.68
         Den dominikanske republikk |          1        0.02       35.71
                              Egypt |          2        0.05       35.76
                    Elfenbenskysten |          4        0.10       35.85
                            Eritrea |         28        0.68       36.53
                            Estland |          9        0.22       36.75
                            Etiopia |         20        0.48       37.23
                        Filippinene |         86        2.08       39.30
                            Finland |         38        0.92       40.22
                          Frankrike |         19        0.46       40.68
                             Gambia |          2        0.05       40.73
                            Georgia |          2        0.05       40.78
                              Ghana |          9        0.22       40.99
                          Guatemala |          1        0.02       41.02
                             Guyana |          1        0.02       41.04
                              Haiti |          1        0.02       41.07
                             Hellas |          5        0.12       41.19
                      Hviterussland |          6        0.14       41.33
                              India |         22        0.53       41.86
                          Indonesia |          8        0.19       42.06
                               Irak |         70        1.69       43.75
                               Iran |         49        1.18       44.93
                             Irland |          6        0.14       45.07
                             Island |         65        1.57       46.64
                             Israel |          6        0.14       46.79
                             Italia |         18        0.43       47.22
                              Japan |          9        0.22       47.44
                            Kamerun |          1        0.02       47.46
                         Kasakhstan |          3        0.07       47.54
                              Kenya |          8        0.19       47.73
                               Kina |         32        0.77       48.50
Kongo, Den demokratiske republikken |         12        0.29       48.79
                 Kongo, Republikken |          1        0.02       48.82
                             Kosovo |         34        0.82       49.64
                            Kroatia |         15        0.36       50.00
                             Kuwait |          4        0.10       50.10
                             Kypros |          1        0.02       50.12
                             Latvia |         37        0.89       51.01
                            Libanon |          7        0.17       51.18
                            Liberia |          3        0.07       51.26
                              Libya |          1        0.02       51.28
                            Litauen |        107        2.58       53.86
                         Luxembourg |          2        0.05       53.91
                         Madagaskar |          1        0.02       53.94
                             Malawi |          1        0.02       53.96
                           Malaysia |          7        0.17       54.13
                              Malta |          2        0.05       54.18
                            Marokko |          6        0.14       54.32
                             Mexico |         11        0.27       54.59
                    Myanmar (Burma) |          6        0.14       54.73
                          Nederland |        127        3.07       57.80
                              Nepal |          7        0.17       57.97
                        New Zealand |          5        0.12       58.09
                          Nicaragua |          1        0.02       58.11
                            Nigeria |          6        0.14       58.26
                     Nord-Makedonia |          6        0.14       58.40
                              Norge |        232        5.60       64.00
                               Oman |          1        0.02       64.03
                           Pakistan |         10        0.24       64.27
                          Palestina |          6        0.14       64.41
                             Panama |          2        0.05       64.46
                           Paraguay |          2        0.05       64.51
                              Polen |        239        5.77       70.28
                           Portugal |         17        0.41       70.69
                              Qatar |          1        0.02       70.71
                            Romania |         27        0.65       71.37
                           Russland |         52        1.26       72.62
                             Rwanda |          2        0.05       72.67
                       Saudi-Arabia |          2        0.05       72.72
                            Senegal |          1        0.02       72.74
                             Serbia |         28        0.68       73.42
                       Sierra Leone |          1        0.02       73.44
                          Singapore |          5        0.12       73.56
                           Slovakia |          9        0.22       73.78
                           Slovenia |          1        0.02       73.80
                            Somalia |         28        0.68       74.48
                             Spania |         21        0.51       74.99
                          Sri Lanka |          5        0.12       75.11
                      Storbritannia |        124        2.99       78.10
                              Sudan |         10        0.24       78.34
                            Surinam |          1        0.02       78.37
                             Sveits |         19        0.46       78.83
                            Sverige |        283        6.83       85.66
                              Syria |         52        1.26       86.91
                         Sør-Afrika |         18        0.43       87.35
                          Sør-Korea |         34        0.82       88.17
                             Taiwan |          1        0.02       88.19
                           Tanzania |          5        0.12       88.31
                           Thailand |         65        1.57       89.88
                 Trinidad og Tobago |          3        0.07       89.96
                           Tsjekkia |          5        0.12       90.08
                            Tunisia |          2        0.05       90.13
                             Tyrkia |         20        0.48       90.61
                           Tyskland |        215        5.19       95.80
                             Uganda |          1        0.02       95.82
                            Ukraina |         23        0.56       96.38
                             Ungarn |         15        0.36       96.74
                                USA |         84        2.03       98.77
                          Venezuela |          4        0.10       98.87
                            Vietnam |         23        0.56       99.42
                             Zambia |          1        0.02       99.44
                           Zimbabwe |          1        0.02       99.47
                          Østerrike |         12        0.29       99.76
                              Annet |         10        0.24      100.00
------------------------------------+-----------------------------------
                              Total |      4,142      100.00

. *norsk med norske foreldre
. gen landgruppe=0

. 
. *Norge med utenlandske forelder/re
. replace landgruppe=1 if QFVT_7_8A_1==1 | QFVT_7_8A_1==131
(1,255 real changes made)

. 
. *norden u Norge
. replace landgruppe=2 if inlist(QFVT_7_8A_1, 34,51,71,168)
(603 real changes made)

. 
. *EU/EØS-området utenom Norden
. replace landgruppe=3 if inlist(QFVT_7_8A_1,5,16,25,46,52,63,70,73,92,94,99,100,101,107,115,122,140,141,
> 143,151,159,160,162,167,181,186,189,194,200)
(945 real changes made)

. 
. *Europa utenfor EU/EØS-området
. replace landgruppe=4 if inlist(QFVT_7_8A_1,3,21,65,89,90,114,117,130,144,155,188)
(215 real changes made)

. 
. *Asia, Afrika, Latin-Amerika, Oseania utenom Australia og New Zealand
. replace landgruppe=5 if inlist(QFVT_7_8A_1, 2,4,6,7,8,9,10,12,13,14,15,17,18,19,20,22,23,24,26,27,29,30
> ,31,32,33,35,36,37,38,39,40,41,42,43,44,45,47,48,49,50,53,54,55,56,57,58,59,60,61,62,64,66,67,68,69,72,
> 74,75,76,77,7,79,80,81,82,83,84,85,86,87,88,91,93,95,96,97,98,102,103,104,105,106,108,109,110,111,112,1
> 13,116,118,119,120,121,123,125,126,127,128,129,132,133,134,135,136,137,138,139,142,145,146,147,148,149,
> 150,152,153,154,156,157,158,161,163,165,166,169,170,171,172,173,174,175,176,177,178,179,180,182,183,184
> ,185,187,190,192,193,195,196,197,198,199,201)
(873 real changes made)

. 
. *USA, Canada, Australia og New Zealand
. replace landgruppe=6 if inlist(QFVT_7_8A_1, 11,28,124,164,191)
(241 real changes made)

. 
. *annet
. replace landgruppe=7 if inlist(QFVT_7_8A_1, 202)
(10 real changes made)

. 
. tab QFVT_7_8A_1 landgruppe

QFVT_7_8A_1:VT_TSD_NN |
                    ; |
(QFVT_7_8A_1:VT_TSD_B |
  M); 7.8a. I hvilket |                            landgruppe
     land er du født? |         1          2          3          4          5          6 |     Total
----------------------+------------------------------------------------------------------+----------
                Norge |     1,023          0          0          0          0          0 |     1,023 
          Afghanistan |         0          0          0          0         18          0 |        18 
              Albania |         0          0          0          4          0          0 |         4 
              Algerie |         0          0          0          0          3          0 |         3 
              Andorra |         0          0          1          0          0          0 |         1 
               Angola |         0          0          0          0          4          0 |         4 
            Argentina |         0          0          0          0          4          0 |         4 
              Armenia |         0          0          0          0          1          0 |         1 
         Aserbajdsjan |         0          0          0          0          1          0 |         1 
            Australia |         0          0          0          0          0         11 |        11 
           Bangladesh |         0          0          0          0          3          0 |         3 
             Barbados |         0          0          0          0          1          0 |         1 
               Belgia |         0          0         13          0          0          0 |        13 
               Belize |         0          0          0          0          1          0 |         1 
                Benin |         0          0          0          0          1          0 |         1 
               Bhutan |         0          0          0          0          3          0 |         3 
              Bolivia |         0          0          0          0          6          0 |         6 
   Bosnia-Hercegovina |         0          0          0         47          0          0 |        47 
             Botswana |         0          0          0          0          1          0 |         1 
               Brasil |         0          0          0          0         25          0 |        25 
               Brunei |         0          0          0          0          1          0 |         1 
             Bulgaria |         0          0         18          0          0          0 |        18 
         Burkina Faso |         0          0          0          0          1          0 |         1 
              Burundi |         0          0          0          0          4          0 |         4 
               Canada |         0          0          0          0          0         17 |        17 
                Chile |         0          0          0          0         19          0 |        19 
             Colombia |         0          0          0          0         24          0 |        24 
                 Cuba |         0          0          0          0          6          0 |         6 
              Danmark |         0        217          0          0          0          0 |       217 
Den dominikanske repu |         0          0          0          0          1          0 |         1 
                Egypt |         0          0          0          0          2          0 |         2 
      Elfenbenskysten |         0          0          0          0          4          0 |         4 
              Eritrea |         0          0          0          0         28          0 |        28 
              Estland |         0          0          9          0          0          0 |         9 
              Etiopia |         0          0          0          0         20          0 |        20 
          Filippinene |         0          0          0          0         86          0 |        86 
              Finland |         0         38          0          0          0          0 |        38 
            Frankrike |         0          0         19          0          0          0 |        19 
               Gambia |         0          0          0          0          2          0 |         2 
              Georgia |         0          0          0          0          2          0 |         2 
                Ghana |         0          0          0          0          9          0 |         9 
            Guatemala |         0          0          0          0          1          0 |         1 
               Guyana |         0          0          0          0          1          0 |         1 
                Haiti |         0          0          0          0          1          0 |         1 
               Hellas |         0          0          5          0          0          0 |         5 
        Hviterussland |         0          0          0          6          0          0 |         6 
                India |         0          0          0          0         22          0 |        22 
            Indonesia |         0          0          0          0          8          0 |         8 
                 Irak |         0          0          0          0         70          0 |        70 
                 Iran |         0          0          0          0         49          0 |        49 
               Irland |         0          0          6          0          0          0 |         6 
               Island |         0         65          0          0          0          0 |        65 
               Israel |         0          0          0          0          6          0 |         6 
               Italia |         0          0         18          0          0          0 |        18 
                Japan |         0          0          0          0          9          0 |         9 
              Kamerun |         0          0          0          0          1          0 |         1 
           Kasakhstan |         0          0          0          0          3          0 |         3 
                Kenya |         0          0          0          0          8          0 |         8 
                 Kina |         0          0          0          0         32          0 |        32 
Kongo, Den demokratis |         0          0          0          0         12          0 |        12 
   Kongo, Republikken |         0          0          0          0          1          0 |         1 
               Kosovo |         0          0          0         34          0          0 |        34 
              Kroatia |         0          0          0         15          0          0 |        15 
               Kuwait |         0          0          0          0          4          0 |         4 
               Kypros |         0          0          1          0          0          0 |         1 
               Latvia |         0          0         37          0          0          0 |        37 
              Libanon |         0          0          0          0          7          0 |         7 
              Liberia |         0          0          0          0          3          0 |         3 
                Libya |         0          0          0          0          1          0 |         1 
              Litauen |         0          0        107          0          0          0 |       107 
           Luxembourg |         0          0          2          0          0          0 |         2 
           Madagaskar |         0          0          0          0          1          0 |         1 
               Malawi |         0          0          0          0          1          0 |         1 
             Malaysia |         0          0          0          0          7          0 |         7 
                Malta |         0          0          2          0          0          0 |         2 
              Marokko |         0          0          0          0          6          0 |         6 
               Mexico |         0          0          0          0         11          0 |        11 
      Myanmar (Burma) |         0          0          0          0          6          0 |         6 
            Nederland |         0          0        127          0          0          0 |       127 
                Nepal |         0          0          0          0          7          0 |         7 
          New Zealand |         0          0          0          0          0          5 |         5 
            Nicaragua |         0          0          0          0          1          0 |         1 
              Nigeria |         0          0          0          0          6          0 |         6 
       Nord-Makedonia |         0          0          0          6          0          0 |         6 
                Norge |       232          0          0          0          0          0 |       232 
                 Oman |         0          0          0          0          1          0 |         1 
             Pakistan |         0          0          0          0         10          0 |        10 
            Palestina |         0          0          0          0          6          0 |         6 
               Panama |         0          0          0          0          2          0 |         2 
             Paraguay |         0          0          0          0          2          0 |         2 
                Polen |         0          0        239          0          0          0 |       239 
             Portugal |         0          0         17          0          0          0 |        17 
                Qatar |         0          0          0          0          1          0 |         1 
              Romania |         0          0         27          0          0          0 |        27 
             Russland |         0          0          0         52          0          0 |        52 
               Rwanda |         0          0          0          0          2          0 |         2 
         Saudi-Arabia |         0          0          0          0          2          0 |         2 
              Senegal |         0          0          0          0          1          0 |         1 
               Serbia |         0          0          0         28          0          0 |        28 
         Sierra Leone |         0          0          0          0          1          0 |         1 
            Singapore |         0          0          0          0          5          0 |         5 
             Slovakia |         0          0          9          0          0          0 |         9 
             Slovenia |         0          0          1          0          0          0 |         1 
              Somalia |         0          0          0          0         28          0 |        28 
               Spania |         0          0         21          0          0          0 |        21 
            Sri Lanka |         0          0          0          0          5          0 |         5 
        Storbritannia |         0          0          0          0          0        124 |       124 
                Sudan |         0          0          0          0         10          0 |        10 
              Surinam |         0          0          0          0          1          0 |         1 
               Sveits |         0          0         19          0          0          0 |        19 
              Sverige |         0        283          0          0          0          0 |       283 
                Syria |         0          0          0          0         52          0 |        52 
           Sør-Afrika |         0          0          0          0         18          0 |        18 
            Sør-Korea |         0          0          0          0         34          0 |        34 
               Taiwan |         0          0          0          0          1          0 |         1 
             Tanzania |         0          0          0          0          5          0 |         5 
             Thailand |         0          0          0          0         65          0 |        65 
   Trinidad og Tobago |         0          0          0          0          3          0 |         3 
             Tsjekkia |         0          0          5          0          0          0 |         5 
              Tunisia |         0          0          0          0          2          0 |         2 
               Tyrkia |         0          0          0          0         20          0 |        20 
             Tyskland |         0          0        215          0          0          0 |       215 
               Uganda |         0          0          0          0          1          0 |         1 
              Ukraina |         0          0          0         23          0          0 |        23 
               Ungarn |         0          0         15          0          0          0 |        15 
                  USA |         0          0          0          0          0         84 |        84 
            Venezuela |         0          0          0          0          4          0 |         4 
              Vietnam |         0          0          0          0         23          0 |        23 
               Zambia |         0          0          0          0          1          0 |         1 
             Zimbabwe |         0          0          0          0          1          0 |         1 
            Østerrike |         0          0         12          0          0          0 |        12 
                Annet |         0          0          0          0          0          0 |        10 
----------------------+------------------------------------------------------------------+----------
                Total |     1,255        603        945        215        873        241 |     4,142 


QFVT_7_8A_1:VT_TSD_NN |
                    ; |
(QFVT_7_8A_1:VT_TSD_B |
  M); 7.8a. I hvilket | landgruppe
     land er du født? |         7 |     Total
----------------------+-----------+----------
                Norge |         0 |     1,023 
          Afghanistan |         0 |        18 
              Albania |         0 |         4 
              Algerie |         0 |         3 
              Andorra |         0 |         1 
               Angola |         0 |         4 
            Argentina |         0 |         4 
              Armenia |         0 |         1 
         Aserbajdsjan |         0 |         1 
            Australia |         0 |        11 
           Bangladesh |         0 |         3 
             Barbados |         0 |         1 
               Belgia |         0 |        13 
               Belize |         0 |         1 
                Benin |         0 |         1 
               Bhutan |         0 |         3 
              Bolivia |         0 |         6 
   Bosnia-Hercegovina |         0 |        47 
             Botswana |         0 |         1 
               Brasil |         0 |        25 
               Brunei |         0 |         1 
             Bulgaria |         0 |        18 
         Burkina Faso |         0 |         1 
              Burundi |         0 |         4 
               Canada |         0 |        17 
                Chile |         0 |        19 
             Colombia |         0 |        24 
                 Cuba |         0 |         6 
              Danmark |         0 |       217 
Den dominikanske repu |         0 |         1 
                Egypt |         0 |         2 
      Elfenbenskysten |         0 |         4 
              Eritrea |         0 |        28 
              Estland |         0 |         9 
              Etiopia |         0 |        20 
          Filippinene |         0 |        86 
              Finland |         0 |        38 
            Frankrike |         0 |        19 
               Gambia |         0 |         2 
              Georgia |         0 |         2 
                Ghana |         0 |         9 
            Guatemala |         0 |         1 
               Guyana |         0 |         1 
                Haiti |         0 |         1 
               Hellas |         0 |         5 
        Hviterussland |         0 |         6 
                India |         0 |        22 
            Indonesia |         0 |         8 
                 Irak |         0 |        70 
                 Iran |         0 |        49 
               Irland |         0 |         6 
               Island |         0 |        65 
               Israel |         0 |         6 
               Italia |         0 |        18 
                Japan |         0 |         9 
              Kamerun |         0 |         1 
           Kasakhstan |         0 |         3 
                Kenya |         0 |         8 
                 Kina |         0 |        32 
Kongo, Den demokratis |         0 |        12 
   Kongo, Republikken |         0 |         1 
               Kosovo |         0 |        34 
              Kroatia |         0 |        15 
               Kuwait |         0 |         4 
               Kypros |         0 |         1 
               Latvia |         0 |        37 
              Libanon |         0 |         7 
              Liberia |         0 |         3 
                Libya |         0 |         1 
              Litauen |         0 |       107 
           Luxembourg |         0 |         2 
           Madagaskar |         0 |         1 
               Malawi |         0 |         1 
             Malaysia |         0 |         7 
                Malta |         0 |         2 
              Marokko |         0 |         6 
               Mexico |         0 |        11 
      Myanmar (Burma) |         0 |         6 
            Nederland |         0 |       127 
                Nepal |         0 |         7 
          New Zealand |         0 |         5 
            Nicaragua |         0 |         1 
              Nigeria |         0 |         6 
       Nord-Makedonia |         0 |         6 
                Norge |         0 |       232 
                 Oman |         0 |         1 
             Pakistan |         0 |        10 
            Palestina |         0 |         6 
               Panama |         0 |         2 
             Paraguay |         0 |         2 
                Polen |         0 |       239 
             Portugal |         0 |        17 
                Qatar |         0 |         1 
              Romania |         0 |        27 
             Russland |         0 |        52 
               Rwanda |         0 |         2 
         Saudi-Arabia |         0 |         2 
              Senegal |         0 |         1 
               Serbia |         0 |        28 
         Sierra Leone |         0 |         1 
            Singapore |         0 |         5 
             Slovakia |         0 |         9 
             Slovenia |         0 |         1 
              Somalia |         0 |        28 
               Spania |         0 |        21 
            Sri Lanka |         0 |         5 
        Storbritannia |         0 |       124 
                Sudan |         0 |        10 
              Surinam |         0 |         1 
               Sveits |         0 |        19 
              Sverige |         0 |       283 
                Syria |         0 |        52 
           Sør-Afrika |         0 |        18 
            Sør-Korea |         0 |        34 
               Taiwan |         0 |         1 
             Tanzania |         0 |         5 
             Thailand |         0 |        65 
   Trinidad og Tobago |         0 |         3 
             Tsjekkia |         0 |         5 
              Tunisia |         0 |         2 
               Tyrkia |         0 |        20 
             Tyskland |         0 |       215 
               Uganda |         0 |         1 
              Ukraina |         0 |        23 
               Ungarn |         0 |        15 
                  USA |         0 |        84 
            Venezuela |         0 |         4 
              Vietnam |         0 |        23 
               Zambia |         0 |         1 
             Zimbabwe |         0 |         1 
            Østerrike |         0 |        12 
                Annet |        10 |        10 
----------------------+-----------+----------
                Total |        10 |     4,142 

. 
. *tar bort annet for denne omgang
. drop QFVT_7_8A_2 

. 
. 
. label define land2 0 "Norge m/n/foreldre" 1 "Norge" 2 "Norden u/Norge" 3 "EU/EØS u/Norden" 4 "Europa u/
> EU/EØS" 5 "Afrika/Asia/Latin-Amerika/andre" 6 "USA/Canada/Aus/New/UK" 7 "annet"

. label values landgruppe land2

. 
. tab QFVT_7_8A_1 landgruppe

QFVT_7_8A_1:VT_TSD_NN |
                    ; |
(QFVT_7_8A_1:VT_TSD_B |
  M); 7.8a. I hvilket |                            landgruppe
     land er du født? |     Norge  Norden u/  EU/EØS u/  Europa u/  Afrika/As  USA/Canad |     Total
----------------------+------------------------------------------------------------------+----------
                Norge |     1,023          0          0          0          0          0 |     1,023 
          Afghanistan |         0          0          0          0         18          0 |        18 
              Albania |         0          0          0          4          0          0 |         4 
              Algerie |         0          0          0          0          3          0 |         3 
              Andorra |         0          0          1          0          0          0 |         1 
               Angola |         0          0          0          0          4          0 |         4 
            Argentina |         0          0          0          0          4          0 |         4 
              Armenia |         0          0          0          0          1          0 |         1 
         Aserbajdsjan |         0          0          0          0          1          0 |         1 
            Australia |         0          0          0          0          0         11 |        11 
           Bangladesh |         0          0          0          0          3          0 |         3 
             Barbados |         0          0          0          0          1          0 |         1 
               Belgia |         0          0         13          0          0          0 |        13 
               Belize |         0          0          0          0          1          0 |         1 
                Benin |         0          0          0          0          1          0 |         1 
               Bhutan |         0          0          0          0          3          0 |         3 
              Bolivia |         0          0          0          0          6          0 |         6 
   Bosnia-Hercegovina |         0          0          0         47          0          0 |        47 
             Botswana |         0          0          0          0          1          0 |         1 
               Brasil |         0          0          0          0         25          0 |        25 
               Brunei |         0          0          0          0          1          0 |         1 
             Bulgaria |         0          0         18          0          0          0 |        18 
         Burkina Faso |         0          0          0          0          1          0 |         1 
              Burundi |         0          0          0          0          4          0 |         4 
               Canada |         0          0          0          0          0         17 |        17 
                Chile |         0          0          0          0         19          0 |        19 
             Colombia |         0          0          0          0         24          0 |        24 
                 Cuba |         0          0          0          0          6          0 |         6 
              Danmark |         0        217          0          0          0          0 |       217 
Den dominikanske repu |         0          0          0          0          1          0 |         1 
                Egypt |         0          0          0          0          2          0 |         2 
      Elfenbenskysten |         0          0          0          0          4          0 |         4 
              Eritrea |         0          0          0          0         28          0 |        28 
              Estland |         0          0          9          0          0          0 |         9 
              Etiopia |         0          0          0          0         20          0 |        20 
          Filippinene |         0          0          0          0         86          0 |        86 
              Finland |         0         38          0          0          0          0 |        38 
            Frankrike |         0          0         19          0          0          0 |        19 
               Gambia |         0          0          0          0          2          0 |         2 
              Georgia |         0          0          0          0          2          0 |         2 
                Ghana |         0          0          0          0          9          0 |         9 
            Guatemala |         0          0          0          0          1          0 |         1 
               Guyana |         0          0          0          0          1          0 |         1 
                Haiti |         0          0          0          0          1          0 |         1 
               Hellas |         0          0          5          0          0          0 |         5 
        Hviterussland |         0          0          0          6          0          0 |         6 
                India |         0          0          0          0         22          0 |        22 
            Indonesia |         0          0          0          0          8          0 |         8 
                 Irak |         0          0          0          0         70          0 |        70 
                 Iran |         0          0          0          0         49          0 |        49 
               Irland |         0          0          6          0          0          0 |         6 
               Island |         0         65          0          0          0          0 |        65 
               Israel |         0          0          0          0          6          0 |         6 
               Italia |         0          0         18          0          0          0 |        18 
                Japan |         0          0          0          0          9          0 |         9 
              Kamerun |         0          0          0          0          1          0 |         1 
           Kasakhstan |         0          0          0          0          3          0 |         3 
                Kenya |         0          0          0          0          8          0 |         8 
                 Kina |         0          0          0          0         32          0 |        32 
Kongo, Den demokratis |         0          0          0          0         12          0 |        12 
   Kongo, Republikken |         0          0          0          0          1          0 |         1 
               Kosovo |         0          0          0         34          0          0 |        34 
              Kroatia |         0          0          0         15          0          0 |        15 
               Kuwait |         0          0          0          0          4          0 |         4 
               Kypros |         0          0          1          0          0          0 |         1 
               Latvia |         0          0         37          0          0          0 |        37 
              Libanon |         0          0          0          0          7          0 |         7 
              Liberia |         0          0          0          0          3          0 |         3 
                Libya |         0          0          0          0          1          0 |         1 
              Litauen |         0          0        107          0          0          0 |       107 
           Luxembourg |         0          0          2          0          0          0 |         2 
           Madagaskar |         0          0          0          0          1          0 |         1 
               Malawi |         0          0          0          0          1          0 |         1 
             Malaysia |         0          0          0          0          7          0 |         7 
                Malta |         0          0          2          0          0          0 |         2 
              Marokko |         0          0          0          0          6          0 |         6 
               Mexico |         0          0          0          0         11          0 |        11 
      Myanmar (Burma) |         0          0          0          0          6          0 |         6 
            Nederland |         0          0        127          0          0          0 |       127 
                Nepal |         0          0          0          0          7          0 |         7 
          New Zealand |         0          0          0          0          0          5 |         5 
            Nicaragua |         0          0          0          0          1          0 |         1 
              Nigeria |         0          0          0          0          6          0 |         6 
       Nord-Makedonia |         0          0          0          6          0          0 |         6 
                Norge |       232          0          0          0          0          0 |       232 
                 Oman |         0          0          0          0          1          0 |         1 
             Pakistan |         0          0          0          0         10          0 |        10 
            Palestina |         0          0          0          0          6          0 |         6 
               Panama |         0          0          0          0          2          0 |         2 
             Paraguay |         0          0          0          0          2          0 |         2 
                Polen |         0          0        239          0          0          0 |       239 
             Portugal |         0          0         17          0          0          0 |        17 
                Qatar |         0          0          0          0          1          0 |         1 
              Romania |         0          0         27          0          0          0 |        27 
             Russland |         0          0          0         52          0          0 |        52 
               Rwanda |         0          0          0          0          2          0 |         2 
         Saudi-Arabia |         0          0          0          0          2          0 |         2 
              Senegal |         0          0          0          0          1          0 |         1 
               Serbia |         0          0          0         28          0          0 |        28 
         Sierra Leone |         0          0          0          0          1          0 |         1 
            Singapore |         0          0          0          0          5          0 |         5 
             Slovakia |         0          0          9          0          0          0 |         9 
             Slovenia |         0          0          1          0          0          0 |         1 
              Somalia |         0          0          0          0         28          0 |        28 
               Spania |         0          0         21          0          0          0 |        21 
            Sri Lanka |         0          0          0          0          5          0 |         5 
        Storbritannia |         0          0          0          0          0        124 |       124 
                Sudan |         0          0          0          0         10          0 |        10 
              Surinam |         0          0          0          0          1          0 |         1 
               Sveits |         0          0         19          0          0          0 |        19 
              Sverige |         0        283          0          0          0          0 |       283 
                Syria |         0          0          0          0         52          0 |        52 
           Sør-Afrika |         0          0          0          0         18          0 |        18 
            Sør-Korea |         0          0          0          0         34          0 |        34 
               Taiwan |         0          0          0          0          1          0 |         1 
             Tanzania |         0          0          0          0          5          0 |         5 
             Thailand |         0          0          0          0         65          0 |        65 
   Trinidad og Tobago |         0          0          0          0          3          0 |         3 
             Tsjekkia |         0          0          5          0          0          0 |         5 
              Tunisia |         0          0          0          0          2          0 |         2 
               Tyrkia |         0          0          0          0         20          0 |        20 
             Tyskland |         0          0        215          0          0          0 |       215 
               Uganda |         0          0          0          0          1          0 |         1 
              Ukraina |         0          0          0         23          0          0 |        23 
               Ungarn |         0          0         15          0          0          0 |        15 
                  USA |         0          0          0          0          0         84 |        84 
            Venezuela |         0          0          0          0          4          0 |         4 
              Vietnam |         0          0          0          0         23          0 |        23 
               Zambia |         0          0          0          0          1          0 |         1 
             Zimbabwe |         0          0          0          0          1          0 |         1 
            Østerrike |         0          0         12          0          0          0 |        12 
                Annet |         0          0          0          0          0          0 |        10 
----------------------+------------------------------------------------------------------+----------
                Total |     1,255        603        945        215        873        241 |     4,142 


QFVT_7_8A_1:VT_TSD_NN |
                    ; |
(QFVT_7_8A_1:VT_TSD_B |
  M); 7.8a. I hvilket | landgruppe
     land er du født? |     annet |     Total
----------------------+-----------+----------
                Norge |         0 |     1,023 
          Afghanistan |         0 |        18 
              Albania |         0 |         4 
              Algerie |         0 |         3 
              Andorra |         0 |         1 
               Angola |         0 |         4 
            Argentina |         0 |         4 
              Armenia |         0 |         1 
         Aserbajdsjan |         0 |         1 
            Australia |         0 |        11 
           Bangladesh |         0 |         3 
             Barbados |         0 |         1 
               Belgia |         0 |        13 
               Belize |         0 |         1 
                Benin |         0 |         1 
               Bhutan |         0 |         3 
              Bolivia |         0 |         6 
   Bosnia-Hercegovina |         0 |        47 
             Botswana |         0 |         1 
               Brasil |         0 |        25 
               Brunei |         0 |         1 
             Bulgaria |         0 |        18 
         Burkina Faso |         0 |         1 
              Burundi |         0 |         4 
               Canada |         0 |        17 
                Chile |         0 |        19 
             Colombia |         0 |        24 
                 Cuba |         0 |         6 
              Danmark |         0 |       217 
Den dominikanske repu |         0 |         1 
                Egypt |         0 |         2 
      Elfenbenskysten |         0 |         4 
              Eritrea |         0 |        28 
              Estland |         0 |         9 
              Etiopia |         0 |        20 
          Filippinene |         0 |        86 
              Finland |         0 |        38 
            Frankrike |         0 |        19 
               Gambia |         0 |         2 
              Georgia |         0 |         2 
                Ghana |         0 |         9 
            Guatemala |         0 |         1 
               Guyana |         0 |         1 
                Haiti |         0 |         1 
               Hellas |         0 |         5 
        Hviterussland |         0 |         6 
                India |         0 |        22 
            Indonesia |         0 |         8 
                 Irak |         0 |        70 
                 Iran |         0 |        49 
               Irland |         0 |         6 
               Island |         0 |        65 
               Israel |         0 |         6 
               Italia |         0 |        18 
                Japan |         0 |         9 
              Kamerun |         0 |         1 
           Kasakhstan |         0 |         3 
                Kenya |         0 |         8 
                 Kina |         0 |        32 
Kongo, Den demokratis |         0 |        12 
   Kongo, Republikken |         0 |         1 
               Kosovo |         0 |        34 
              Kroatia |         0 |        15 
               Kuwait |         0 |         4 
               Kypros |         0 |         1 
               Latvia |         0 |        37 
              Libanon |         0 |         7 
              Liberia |         0 |         3 
                Libya |         0 |         1 
              Litauen |         0 |       107 
           Luxembourg |         0 |         2 
           Madagaskar |         0 |         1 
               Malawi |         0 |         1 
             Malaysia |         0 |         7 
                Malta |         0 |         2 
              Marokko |         0 |         6 
               Mexico |         0 |        11 
      Myanmar (Burma) |         0 |         6 
            Nederland |         0 |       127 
                Nepal |         0 |         7 
          New Zealand |         0 |         5 
            Nicaragua |         0 |         1 
              Nigeria |         0 |         6 
       Nord-Makedonia |         0 |         6 
                Norge |         0 |       232 
                 Oman |         0 |         1 
             Pakistan |         0 |        10 
            Palestina |         0 |         6 
               Panama |         0 |         2 
             Paraguay |         0 |         2 
                Polen |         0 |       239 
             Portugal |         0 |        17 
                Qatar |         0 |         1 
              Romania |         0 |        27 
             Russland |         0 |        52 
               Rwanda |         0 |         2 
         Saudi-Arabia |         0 |         2 
              Senegal |         0 |         1 
               Serbia |         0 |        28 
         Sierra Leone |         0 |         1 
            Singapore |         0 |         5 
             Slovakia |         0 |         9 
             Slovenia |         0 |         1 
              Somalia |         0 |        28 
               Spania |         0 |        21 
            Sri Lanka |         0 |         5 
        Storbritannia |         0 |       124 
                Sudan |         0 |        10 
              Surinam |         0 |         1 
               Sveits |         0 |        19 
              Sverige |         0 |       283 
                Syria |         0 |        52 
           Sør-Afrika |         0 |        18 
            Sør-Korea |         0 |        34 
               Taiwan |         0 |         1 
             Tanzania |         0 |         5 
             Thailand |         0 |        65 
   Trinidad og Tobago |         0 |         3 
             Tsjekkia |         0 |         5 
              Tunisia |         0 |         2 
               Tyrkia |         0 |        20 
             Tyskland |         0 |       215 
               Uganda |         0 |         1 
              Ukraina |         0 |        23 
               Ungarn |         0 |        15 
                  USA |         0 |        84 
            Venezuela |         0 |         4 
              Vietnam |         0 |        23 
               Zambia |         0 |         1 
             Zimbabwe |         0 |         1 
            Østerrike |         0 |        12 
                Annet |        10 |        10 
----------------------+-----------+----------
                Total |        10 |     4,142 

. drop QFVT_7_8A_1

. 
. *********************************************************
. *mor født 
. * var: QFVT_7_8B_1 
. 
. 
. gen landgruppeM=.
(34,147 missing values generated)

. 
. *Norge 
. replace landgruppeM=1 if QFVT_7_8B_1==1 | QFVT_7_8B_1==131
(862 real changes made)

. 
. *norden u Norge
. replace landgruppeM=2 if inlist(QFVT_7_8B_1, 34,51,71,168)
(770 real changes made)

. 
. *EU/EØS-området utenom Norden
. replace landgruppeM=3 if inlist(QFVT_7_8B_1,5,16,25,46,52,63,70,73,92,94,99,100,101,107,115,122,140,141
> ,143,151,159,160,162,167,181,186,189,194,200)
(1,010 real changes made)

. 
. *Europa utenfor EU/EØS-området
. replace landgruppeM=4 if inlist(QFVT_7_8B_1,3,21,65,89,90,114,117,130,144,155,188)
(256 real changes made)

. 
. *Asia, Afrika, Latin-Amerika, Oseania utenom Australia og New Zealand
. replace landgruppeM=5 if inlist(QFVT_7_8B_1, 2,4,6,7,8,9,10,12,13,14,15,17,18,19,20,22,23,24,26,27,29,3
> 0,31,32,33,35,36,37,38,39,40,41,42,43,44,45,47,48,49,50,53,54,55,56,57,58,59,60,61,62,64,66,67,68,69,72
> ,74,75,76,77,7,79,80,81,82,83,84,85,86,87,88,91,93,95,96,97,98,102,103,104,105,106,108,109,110,111,112,
> 113,116,118,119,120,121,123,125,126,127,128,129,132,133,134,135,136,137,138,139,142,145,146,147,148,149
> ,150,152,153,154,156,157,158,161,163,165,166,169,170,171,172,173,174,175,176,177,178,179,180,182,183,18
> 4,185,187,190,192,193,195,196,197,198,199,201)
(917 real changes made)

. 
. *USA, Canada, Australia og New Zealand UK
. replace landgruppeM=6 if inlist(QFVT_7_8B_1, 11,28,124,164,191)
(298 real changes made)

. 
. *annet
. replace landgruppeM=7 if inlist(QFVT_7_8B_1, 202)
(10 real changes made)

. 
. label define land3  1 "Norge" 2 "Norden u/Norge" 3 "EU/EØS u/Norden" 4 "Europa u/EU/EØS" 5 "Afrika/Asia
> /Latin-Amerika/andre" 6 "USA/Canada/Aus/New/UK" 7 "annet"

. label values landgruppeM land3

. 
. drop QFVT_7_8B_1 QFVT_7_8B_2    //drop fødeland og annet

. 
. *********************************************************
. *far født 
. * var:  QFVT_7_8C_1
.  
. 
. 
. gen landgruppeF=.
(34,147 missing values generated)

. 
. *Norge 
. replace landgruppeF=1 if QFVT_7_8C_1==1 | QFVT_7_8C_1==131
(886 real changes made)

. 
. *norden u Norge
. replace landgruppeF=2 if inlist(QFVT_7_8C_1, 34,51,71,168)
(704 real changes made)

. 
. *EU/EØS-området utenom Norden
. replace landgruppeF=3 if inlist(QFVT_7_8C_1,5,16,25,46,52,63,70,73,92,94,99,100,101,107,115,122,140,141
> ,143,151,159,160,162,167,181,186,189,194,200)
(1,050 real changes made)

. 
. *Europa utenfor EU/EØS-området
. replace landgruppeF=4 if inlist(QFVT_7_8C_1,3,21,65,89,90,114,117,130,144,155,188)
(268 real changes made)

. 
. *Asia, Afrika, Latin-Amerika, Oseania utenom Australia og New Zealand
. replace landgruppeF=5 if inlist(QFVT_7_8C_1, 2,4,6,7,8,9,10,12,13,14,15,17,18,19,20,22,23,24,26,27,29,3
> 0,31,32,33,35,36,37,38,39,40,41,42,43,44,45,47,48,49,50,53,54,55,56,57,58,59,60,61,62,64,66,67,68,69,72
> ,74,75,76,77,7,79,80,81,82,83,84,85,86,87,88,91,93,95,96,97,98,102,103,104,105,106,108,109,110,111,112,
> 113,116,118,119,120,121,123,125,126,127,128,129,132,133,134,135,136,137,138,139,142,145,146,147,148,149
> ,150,152,153,154,156,157,158,161,163,165,166,169,170,171,172,173,174,175,176,177,178,179,180,182,183,18
> 4,185,187,190,192,193,195,196,197,198,199,201)
(900 real changes made)

. 
. *USA, Canada, Australia og New Zealand UK
. replace landgruppeF=6 if inlist(QFVT_7_8C_1, 11,28,124,164,191)
(267 real changes made)

. 
. *annet
. replace landgruppeF=7 if inlist(QFVT_7_8C_1, 202)
(11 real changes made)

. 
. 
. label values landgruppeF land3

. 
. drop QFVT_7_8C_1 QFVT_7_8C_2 //fødeland og annet

. 
. tab landgruppeF landgruppeM

                      |                            landgruppeM
          landgruppeF |     Norge  Norden u/  EU/EØS u/  Europa u/  Afrika/As  USA/Canad |     Total
----------------------+------------------------------------------------------------------+----------
                Norge |       184        302        121          7         97        164 |       878 
       Norden u/Norge |       260        427          5          0          2          2 |       696 
      EU/EØS u/Norden |       170         10        840         11          4          6 |     1,042 
      Europa u/EU/EØS |        15          5          9        231          4          1 |       265 
Afrika/Asia/Latin-Ame |        96          7          5          2        784          1 |       895 
USA/Canada/Aus/New/UK |       124         10         12          0          2        117 |       265 
                annet |         3          0          0          1          1          0 |        11 
----------------------+------------------------------------------------------------------+----------
                Total |       852        761        992        252        894        291 |     4,052 


                      | landgruppe
                      |     M
          landgruppeF |     annet |     Total
----------------------+-----------+----------
                Norge |         3 |       878 
       Norden u/Norge |         0 |       696 
      EU/EØS u/Norden |         1 |     1,042 
      Europa u/EU/EØS |         0 |       265 
Afrika/Asia/Latin-Ame |         0 |       895 
USA/Canada/Aus/New/UK |         0 |       265 
                annet |         6 |        11 
----------------------+-----------+----------
                Total |        10 |     4,052 

. 
. *kategoriserer alder
. *Alder
. label var alder Alder

. destring alder, replace
alder: all characters numeric; replaced as byte

. 
. 
. *Alderskategorier
. egen alderkat=cut(alder), at(18,30,40,50,60,70,100) icodes

. label define alderkat 0 "18-29" 1 "30-39" 2 "40-49" 3 "50-59" 4 "60-69" 5 "70+", modify

. label var alderkat Alderskategorier

. label val alderkat alderkat

. 
. table alderkat, statistic(min alder) statistic(max alder) statistic(  count alder)

--------------------------------------------------------------------------------
                 |  Minimum value   Maximum value   Number of non-missing values
-----------------+--------------------------------------------------------------
Alderskategorier |                                                              
  18-29          |             18              29                          3,967
  30-39          |             30              39                          4,670
  40-49          |             40              49                          5,922
  50-59          |             50              59                          7,448
  60-69          |             60              69                          6,986
  70+            |             70              96                          5,154
  Total          |             18              96                         34,147
--------------------------------------------------------------------------------

. 
. *dropper alder og fødselsår
. drop alder

. drop FodselsAar

. 
. *randomiserer alle individer slik at fil ikke kan matches mot original
. set seed 626262                         

. gen sortorder = runiform()      //genererer random id for alle, mellom 0 og 1.

. sort sortorder                          // sorterer fil etter id

. drop sortorder                          //dropper id.

. 
. drop kommunenr //dropp kommunenummer

. 
. *setter opp KMI, fjerner høyde og vekt, og trunkerer
. gen KMI=.
(34,147 missing values generated)

. replace KMI=QFVT_2_5/((QFVT_2_4/100)^2)
(33,280 real changes made)

. 
. *tar bort KMI som ansees som urealistiske
. recode KMI (min/13.999=.) (80.001/max=.)
(107 changes made to KMI)

. 
. *grupperer KMI
. recode KMI (min/18.49999=1 "<18.5")(18.5/24.999=2 "18.5-24,9")(25/29.999=3 "25-29,9")(30/34.999=4 "30-3
> 4,9")(35/39.999=5 "35-39,9")(40/max=6 "40+"), gen(KMIgruppert)
(33173 differences between KMI and KMIgruppert)

. 
. drop QFVT_2_5 QFVT_2_4 KMI

. 
. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  Kjonn_Kode |          0
Sivilstand~e |          0
    svardato |     34,147    22554.36    4.713506      22550      22571
VERSJON_FH~1 |          0
      ENDRET |     34,147    22554.36    4.715286      22550      22571
-------------+---------------------------------------------------------
    QFVT_1_1 |     34,052    1.269382    .5171846          1          4
    QFVT_1_2 |     34,058    2.107816    1.061932          1          6
    QFVT_1_3 |     34,052    2.035886    1.104402          1          6
    QFVT_1_4 |     34,060    1.862096    .8890945          1          6
    QFVT_1_5 |     34,074    2.984768     1.47276          1          6
-------------+---------------------------------------------------------
    QFVT_1_6 |     34,067    1.500983    .7554712          1          6
    QFVT_1_7 |     34,053    2.217719    1.687513          1          7
    QFVT_1_8 |     34,058    2.629485    1.269756          1          6
    QFVT_1_9 |     34,040     3.62923    1.197811          1          5
   QFVT_1_10 |     34,059    2.781233    .9795754          1          5
-------------+---------------------------------------------------------
    QFVT_2_1 |     34,069    2.194458    .8624884          1          5
    QFVT_2_2 |     34,072    2.165326    .9094438          1          5
    QFVT_2_3 |     34,061    1.164176    .4797707          1          3
 QFVT_2_3A_1 |      1,045           1           0          1          1
 QFVT_2_3A_2 |        515           1           0          1          1
-------------+---------------------------------------------------------
 QFVT_2_3A_3 |         21           1           0          1          1
 QFVT_2_3A_4 |        443           1           0          1          1
    QFVT_2_6 |     34,038    1.572419    .7708475          1          4
    QFVT_2_7 |     34,023    1.365635    .6623898          1          4
    QFVT_2_8 |     33,995    1.465863    .7428175          1          4
-------------+---------------------------------------------------------
    QFVT_2_9 |     33,996    1.475762    .7142165          1          4
   QFVT_2_10 |     34,027    1.678696    .7495798          1          4
   QFVT_2_11 |     34,044     1.94604    1.021605          1          4
   QFVT_2_12 |     34,025    2.502425    1.141809          1          4
   QFVT_2_13 |     34,029    2.444885    1.015801          1          4
-------------+---------------------------------------------------------
   QFVT_2_14 |     33,684    5.181243    1.300185          1          6
   QFVT_2_15 |     33,294    12.68207    4.262297          1         39
   QFVT_2_16 |     33,980    1.514244    .4998044          1          2
  QFVT_2_16A |     16,467    2.030485    .7966702          1          4
   QFVT_2_17 |     34,011    1.739173    .4390924          1          2
-------------+---------------------------------------------------------
  QFVT_2_17A |      8,851    2.022596     .725444          1          4
   QFVT_2_18 |     34,013    1.563696    .4959335          1          2
  QFVT_2_18A |     14,518    13.31265     9.99193          1         28
  QFVT_2_18B |     14,425    6.452478    8.720444          1         29
   QFVT_2_19 |     34,012    1.583294    .4930205          1          2
-------------+---------------------------------------------------------
  QFVT_2_19A |     13,904    13.70843    9.818727          1         28
  QFVT_2_19B |     13,743    5.359528    7.883865          1         29
    QFVT_3_1 |     34,047    3.094605    .8212482          1          4
    QFVT_3_2 |     34,020    2.029541    .8843816          1          5
    QFVT_3_3 |     33,954    2.424133     1.03639          1          5
-------------+---------------------------------------------------------
    QFVT_3_4 |     34,052    2.200869    1.051409          1          5
    QFVT_3_5 |     34,029    2.187928    .9819279          1          5
    QFVT_3_6 |     34,030    1.901646    1.002213          1          5
    QFVT_4_1 |     32,205    6.707188    3.268702          0         24
    QFVT_4_2 |     33,497    3.973251    1.374388          1          6
-------------+---------------------------------------------------------
   QFVT_4_2A |     31,664     1.66154    .5658965          1          3
   QFVT_4_2B |     31,700    3.043249    .7673605          1          4
 QFVT_4_2C_1 |     30,487    1.711648    .4530033          1          2
 QFVT_4_2C_2 |     30,113    1.670408    .4700728          1          2
 QFVT_4_2C_3 |     31,123    1.120586    .3256508          1          2
-------------+---------------------------------------------------------
 QFVT_4_2C_4 |     30,045    1.321551    .4670795          1          2
 QFVT_4_2D_1 |     30,306    1.315977    .4649115          1          2
 QFVT_4_2D_2 |     30,403    1.267309    .4425623          1          2
 QFVT_4_2D_3 |     28,924    1.664293    .4722453          1          2
 QFVT_4_2D_4 |     29,838    1.502748    .5000008          1          2
-------------+---------------------------------------------------------
    QFVT_4_3 |     25,133    1.777345    .8743252          1          4
    QFVT_4_4 |     34,026    2.528272    1.727091          1          7
    QFVT_4_5 |     34,001    4.523779    1.665772          1          7
    QFVT_4_6 |     34,014    5.260804    1.212706          1          7
    QFVT_4_7 |     34,020    3.360347    1.125029          1          7
-------------+---------------------------------------------------------
    QFVT_4_8 |     34,004    1.838666    .3678441          1          2
   QFVT_4_8A |      5,462    1.419627     .493543          1          2
   QFVT_4_8B |     28,420    2.193315    .9195043          1          3
    QFVT_4_9 |     34,019    1.847262    .3597402          1          2
   QFVT_4_9A |      5,188    1.186584    .3896151          1          2
-------------+---------------------------------------------------------
   QFVT_4_9B |     28,582    2.871003    .4583865          1          3
   QFVT_4_10 |     34,043    1.033164    .1790671          1          2
  QFVT_4_10A |     32,847    2.837763     .994787          1          5
  QFVT_4_10B |     30,234     1.74274    .9870164          1          5
  QFVT_4_10C |     30,269    1.887509    .8089619          1          5
-------------+---------------------------------------------------------
    QFVT_5_1 |     33,967    2.706068    .6828839          1          3
   QFVT_5_1A |      5,560    2.068705    1.460504          1          5
   QFVT_5_1B |      5,456    7.441716    3.725982          1         12
   QFVT_5_1C |      5,452    4.655539    2.183438          1          7
    QFVT_5_2 |     34,045    1.445029    .8619009          1          5
-------------+---------------------------------------------------------
    QFVT_5_3 |     34,040     1.41792    .7796109          1          5
    QFVT_6_1 |     34,013    8.418663    2.102332          1         11
    QFVT_6_2 |     33,697    8.807935    1.976048          1         11
    QFVT_6_3 |     33,936    8.482526    2.235413          1         11
    QFVT_6_4 |     33,999    8.009353    2.129182          1         11
-------------+---------------------------------------------------------
    QFVT_6_5 |     33,939    4.716491    2.753886          1         11
    QFVT_6_6 |     33,943    3.859205    2.735433          1         11
    QFVT_6_7 |     33,960    4.326826    2.493666          1         11
    QFVT_6_8 |     33,952     2.97682    2.633845          1         11
    QFVT_6_9 |     33,867    7.302566    2.350349          1         11
-------------+---------------------------------------------------------
   QFVT_6_10 |     33,922    7.626526    2.345836          1         11
   QFVT_6_11 |     33,915    3.499425    2.660193          1         11
   QFVT_6_12 |     33,826    8.409714    2.413835          1         11
   QFVT_6_13 |     33,802    8.213804    2.187438          1         11
   QFVT_6_14 |     33,943    2.619332    1.007374          1          6
-------------+---------------------------------------------------------
   QFVT_6_15 |     33,937    8.154227    2.393776          1         11
   QFVT_6_16 |     33,928    8.393097    2.559748          1         11
   QFVT_6_17 |     33,984    9.981109    1.590938          1         11
    QFVT_7_1 |     33,967    3.744222    1.686944          1          7
    QFVT_7_2 |     32,575     4.53802    1.316037          1          7
-------------+---------------------------------------------------------
  QFVT_7_3_1 |     16,643           1           0          1          1
  QFVT_7_3_2 |      3,912           1           0          1          1
  QFVT_7_3_3 |      1,929           1           0          1          1
  QFVT_7_3_4 |        924           1           0          1          1
  QFVT_7_3_5 |        639           1           0          1          1
-------------+---------------------------------------------------------
  QFVT_7_3_6 |      3,481           1           0          1          1
  QFVT_7_3_7 |        149           1           0          1          1
  QFVT_7_3_8 |      7,711           1           0          1          1
  QFVT_7_3_9 |      2,011           1           0          1          1
 QFVT_7_3_10 |         65           1           0          1          1
-------------+---------------------------------------------------------
 QFVT_7_3_11 |        297           1           0          1          1
    QFVT_7_4 |     34,000    1.994676      1.2073          1          4
    QFVT_7_5 |     33,794    2.473782     1.15616          1          5
    QFVT_7_6 |     33,007    1.535917    .9178716          1          6
 QFVT_7_6A_1 |        715           1           0          1          1
-------------+---------------------------------------------------------
 QFVT_7_6A_2 |      2,926           1           0          1          1
 QFVT_7_6A_3 |      3,123           1           0          1          1
 QFVT_7_6A_4 |      3,060           1           0          1          1
 QFVT_7_6A_5 |      3,148           1           0          1          1
 QFVT_7_6A_6 |      2,728           1           0          1          1
-------------+---------------------------------------------------------
    QFVT_7_7 |     33,878    1.237499    .5365052          1          3
    QFVT_7_8 |     34,045    1.876693    .3287945          1          2
   QFVT_7_8D |      4,187    5.165035    1.585059          1          7
  QFVT_8_1_1 |     33,001    1.885791    .3180693          1          2
  QFVT_8_1_2 |     32,834    1.966559    .1797877          1          2
-------------+---------------------------------------------------------
  QFVT_8_1_3 |     32,774    1.982242    .1320726          1          2
  QFVT_8_1_4 |     32,693    1.980271    .1390696          1          2
  QFVT_8_1_5 |     33,127    1.812117    .3906246          1          2
  QFVT_8_1_6 |     32,662    1.988917    .1046934          1          2
  QFVT_8_1_7 |     33,098    1.795093    .4036395          1          2
-------------+---------------------------------------------------------
  QFVT_8_1_8 |     32,966    1.800522    .3996142          1          2
  QFVT_8_1_9 |     32,912    1.780202    .4141162          1          2
 QFVT_8_1_10 |     32,651    1.946188    .2256488          1          2
 QFVT_8_1_11 |     33,011     1.69183    .4617442          1          2
 QFVT_8_1_12 |     32,683     1.99743    .0506322          1          2
-------------+---------------------------------------------------------
 QFVT_8_1_13 |     32,823    1.916065    .2772946          1          2
 QFVT_8_1_14 |     32,685    1.992382    .0869504          1          2
 QFVT_8_1_15 |     32,778    1.968973    .1733931          1          2
 QFVT_8_1_16 |     32,782    1.867183    .3393818          1          2
    QFVT_8_2 |     33,982    1.817256     .386462          1          2
-------------+---------------------------------------------------------
    QFVT_8_3 |     33,913    3.893993    1.080832          1          5
    QFVT_8_4 |     33,834    3.524591    1.262306          1          5
    QFVT_8_5 |     33,765    3.791204    1.085111          1          5
    QFVT_8_6 |     33,812    3.794866    1.131777          1          5
    QFVT_8_7 |     33,800    3.941479    1.144521          1          5
-------------+---------------------------------------------------------
  landgruppe |     34,147    .3525053    1.113801          0          7
 landgruppeM |      4,123    3.128547    1.627328          1          7
 landgruppeF |      4,086    3.106951     1.61452          1          7
    alderkat |     34,147    2.710985    1.578263          0          5
 KMIgruppert |     33,173    2.831218    .9260943          1          6

. 
. save "F:\Forskningsprosjekter\PDB 2357 - Fylkeshelseundersøke_\Forskningsfiler\THNI\V&T\V&Tlandgr.dta",
>  replace
file F:\Forskningsprosjekter\PDB 2357 - Fylkeshelseundersøke_\Forskningsfiler\THNI\V&T\V&Tlandgr.dta
    saved

. 
. export delimited "V&Tlandgr", replace
file V&Tlandgr.csv saved

. 
. log close
      name:  <unnamed>
       log:  F:\Forskningsprosjekter\PDB 2357 - Fylkeshelseundersøke_\Forskningsfiler\THNI\V&T\V&T.log
  log type:  text
 closed on:  31 Jan 2022, 16:52:38
---------------------------------------------------------------------------------------------------------
